[
  {
    "url": "https://www.indeed.com/rc/clk?jk=43a7b687bebdce64&bb=i70XG8Qto-CzJPju7JaIOuGxC0i5uXKATasyg8-mQw_q2s7ywP8lT1HXp8pVFlMTiQPgHDBO5k8Q1RlhezafXf60-c3728_71DTFOrDadvo3PG0xPWtemg%3D%3D&xkcb=SoDE67M30a9zX6wh8Z0JbzkdCdPP&fccid=e290923a98afee94&vjs=3",
    "title": "Fullstack Software Engineer",
    "description": "Description\nFullstack Software Engineer\nEnergy, Environment and Infrastructure\n\nLocation: Nationwide Remote. (Portland, Oregon OR Reston, Virginia Preferred)\n\nAre you ready to make a difference?\nWe are seeking a talented Frontend Engineer - Data Visualization to join our Energy, Environmental, and Infrastructure Product and Engineering (EEI P&E) Team. This role supports government and commercial clients in the climate, energy, and clean transportation industries, working across all EEI divisions: Climate, Energy, & Transportation (CET), Environment and Planning (E&P), Utility Program Services (UPS), and Disaster Management (DM). Our goal on the EEI P&E Team is to help clients achieve smart, resilient, and low-carbon growth through our expertise in energy, climate adaptation, greenhouse gas mitigation, sustainability, energy efficiency, and transportation.\nThe ideal candidate has a strong understanding of software engineering principles and a proven track record of being involved in all stages of both large and small projects. Experience working with cross-functional teams and agile software development methodologies is a must, as we value collaboration and flexibility in our approach to project and product management.\n\nThe team supports multiple work streams including software product development, software operations and maintenance, and exploring innovation opportunities to advance our existing suite of offerings. The ideal candidate will be a strong engineer with a broad skillset, growth mindset, and a practical ‘get it done’ work style.\n\nWe operate primarily in greenfield development, synthesizing technologies to create output that meets the needs of our ICF’s domain experts and clients, and as such the suite of software we use is wide. The team also frequently works with geospatial data, so experience in visualizing and manipulating spatial data and spatial data best practices is preferred.\nWhat you will be doing:\nDevelop and maintain software applications in accordance with project requirements in a dynamic, multidisciplinary environment.\nCollaborate with cross-functional teams to design, develop, and implement software solutions.\nWork with internal ICF data scientists, designers, biologists, conservation planners, archaeologists, engineers, transportation experts, and others to build and deliver unique software to meet a wide variety of use cases.\nParticipate in code reviews and peer programming to ensure code quality and adherence to best practices among your peers of software engineers, data modelers, and geospatial information specialists.\nTroubleshoot and resolve software defects and issues.\nContribute to the continuous improvement of software development processes and methodologies within the EEI P&E team.\nWhat we need you to have (minimum qualifications):\nBachelor's Degree in (Information Technology, Computer Science, Software Development or closely related field) and\n5+ years' of experience in Full Stack Development\n5+ years' gathering requirements, and refinement, and planning implementation\n5+ years' in Software development lifecycles: data modeling, cloud and application architecture, user experience and product design, application development, and monitoring.\nExperience with software development methodologies like Agile or Scrum.\nAbility to work independently and proactively, with minimal oversight.\nWhat we would like you to have:\nExperience with the following: AWS, Azure, GCP, Docker, Python, R, C# / .NET, Angular\nFamiliarity with web mapping and charting (or other WebGL) libraries\nRich spatial analysis and mathematical modeling experience\nExperience working with geospatial data\nProficiency in tech solution diagraming and documentation tools such as Draw.io, MS Visio, Mural, Figma, and Confluence\nExperience developing applications consuming and managing high volumes of data\nExperience with UX design principles, (atomic design and component driven design) and a demonstrable eye for clean UI Design\nAbility to convert client needs into concrete steps towards a solution of your design\nAbility to work and communicate effectively with internal and external clients to determine project needs\nDesire to actively share knowledge with team members duing group dev discussions\nAbility to manage multiple competing priorities\nStrong analytical and problem-solving skills with the ability to translate research findings into tech solutions.\n\nPreferred experience in the following:\nFull stack development\nAzure Cloud Services , AWS, or Google Cloud Platform\nSQL databases\nREST/Graph API development and integration\nJavaScript, TypeScript, and Node.js\nReact and NextJS\nGit / Github / DevOps / or similar\nJira or similar\nWorking at ICF\nICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.\nWe can only solve the world's toughest challenges by building a workplace that allows everyone to thrive. We are an equal opportunity employer. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO policy.\n\nReasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation, please email Candidateaccommodation@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nRead more about workplace discrimination rights or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.\n\nCandidate AI Usage Policy\nAt ICF, we are committed to ensuring a fair interview process for all candidates based on their own skills and knowledge. As part of this commitment, the use of artificial intelligence (AI) tools to generate or assist with responses during interviews (whether in-person or virtual) is not permitted. This policy is in place to maintain the integrity and authenticity of the interview process.\nHowever, we understand that some candidates may require accommodation that involves the use of AI. If such an accommodation is needed, candidates are instructed to contact us in advance at candidateaccommodation@icf.com. We are dedicated to providing the necessary support to ensure that all candidates have an equal opportunity to succeed.\n\nPay Range - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.\nThe pay range for this position based on full-time employment is:\n$98,124.00 - $166,810.00\nNationwide Remote Office (US99)",
    "company_location": "Portland, OR 97086",
    "company_name": "ICF",
    "pay_range": [
      "98,124",
      "166,810"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=030caadba1018222&bb=i70XG8Qto-CzJPju7JaIOn96PD_STQkTewYw_OYoE6Ki9OT5W7pOwM34H7l6-jO2eA25vKKJzoA4AgRQterZPRI3oC5l05lfdHCL1NLFrWvBmVmsFxsrqA%3D%3D&xkcb=SoBw67M30a9zX6wh8Z0IbzkdCdPP&fccid=e290923a98afee94&vjs=3",
    "title": "Frontend Software Developer, Data Visualization",
    "description": "Description\nFrontend Software Engineer, Data Visualization\nEnergy, Environment and Infrastructure\n\nLocation: West Coast Preferred (Remote)\n\nAre you ready to make a difference?\nWe are seeking a talented Frontend Engineer - Data Visualization to join our Energy, Environmental, and Infrastructure Product and Engineering (EEI P&E) Team. This role supports government and commercial clients in the climate, energy, and clean transportation industries, working across all EEI divisions: Climate, Energy, & Transportation (CET), Environment and Planning (E&P), Utility Program Services (UPS), and Disaster Management (DM). Our goal on the EEI P&E Team is to help clients achieve smart, resilient, and low-carbon growth through our expertise in energy, climate adaptation, greenhouse gas mitigation, sustainability, energy efficiency, and transportation.\n\nThe Frontend Engineer will lead the design and implementation of high-performance, interactive data visualizations for enterprise-scale applications. This role will own the entire visualization pipeline—from selecting chart types that clarify complex datasets to optimizing React-based dashboards for seamless user interactions. Collaborate with UX and product to bridge aesthetic and functional requirements, ensuring visuals align with brand guidelines while maintaining technical rigor.\n\nThe team supports multiple work streams including software product development, software operations and maintenance, and exploring innovation opportunities to advance our existing suite of offerings. The ideal candidate will be a strong engineer with a design eye, growth mindset, and a practical ‘get it done’ work style.\n\nWe operate primarily in greenfield development, synthesizing technologies to create output that meets the needs of our ICF’s domain experts and clients, and as such the suite of software we use is wide. The team also frequently works with geospatial data, so experience in visualizing and manipulating spatial data and spatial data best practices is preferred.\nWhat you will be doing:\nDesign and develop interactive, user-friendly data visualizations within scalable, responsive browser-hosted applications.\nCollaborate with cross-functional teams to understand data requirements and visualization needs.\nAudit raw datasets to determine optimal visualization strategies.\nUse best practices for data visualization to ensure accuracy and aesthetic appeal.\nEstablish data visualization standards for the team based on best practices and industry trends.\nOptimize visualizations for performance, considering factors like data size and complexity.\nStay updated with the latest trends and tools in data visualization and implement best practices.\nParticipate in code reviews and pair programming to ensure code quality and adherence to best practices.\nWhat we need you to have (minimum qualifications):\nBachelor's Degree in (Information Technology, Computer Science, Software Development or closely related field)\n5+ years of experience with frontend data visualization and charting libraries (e.g., D3.js, Recharts)\n3+ years of experience in JavaScript and frontend frameworks (e.g., React, Angular, Vue.js).\n3+ years of experience evaluating datasets and determining the most effective visualization methods (e.g., charts, tables) to convey information clearly.\n3+ years of hands-on experience in implementing interactive visualizations with a focus on performance optimization, including precomputation strategies and server-side processing.\nExperience with software development methodologies like Agile or Scrum.\nWhat we would like you to have:\nStrong analytical and problem-solving skills with the ability to translate research findings into tech solutions.\nFamiliarity with accessibility standards (e.g., WCAG 2.2, ARIA labels).\nExperience with testing frameworks (e.g., Cypress, Jest) for visualization UIs.\nExperience visualizing multiple types of large amounts of geospatial data in a performant web environment.\nAbility to work and communicate effectively with internal and external clients to determine project needs.\nAbility to manage multiple competing priorities.\n\nExperience in the following preferred:\nD3.js, Recharts, amCharts\nReact, NextJS, and Node.js\nJavaScript, TypeScript\nSQL databases\nGit / Github\nJira or similar\nWorking at ICF\nICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.\nWe can only solve the world's toughest challenges by building a workplace that allows everyone to thrive. We are an equal opportunity employer. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO policy.\n\nReasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation, please email Candidateaccommodation@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nRead more about workplace discrimination rights or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.\n\nCandidate AI Usage Policy\nAt ICF, we are committed to ensuring a fair interview process for all candidates based on their own skills and knowledge. As part of this commitment, the use of artificial intelligence (AI) tools to generate or assist with responses during interviews (whether in-person or virtual) is not permitted. This policy is in place to maintain the integrity and authenticity of the interview process.\nHowever, we understand that some candidates may require accommodation that involves the use of AI. If such an accommodation is needed, candidates are instructed to contact us in advance at candidateaccommodation@icf.com. We are dedicated to providing the necessary support to ensure that all candidates have an equal opportunity to succeed.\n\nPay Range - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.\nThe pay range for this position based on full-time employment is:\n$88,779.00 - $150,924.00\nOregon Remote Office (OR99)",
    "company_location": "Portland, OR 97086",
    "company_name": "ICF",
    "pay_range": [
      "88,779",
      "150,924"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=a89335d20fb327ee&bb=i70XG8Qto-CzJPju7JaIOgg97se8Xfro8SyFMCwN-1DrXuinYiL9LOVeaEklMiAmf0jtT4vR-iC9KGsId9FBbz-3j57VoOcT8C0R0cuQN6sWJlcLLfKO8OvK7a2pCazJ&xkcb=SoD-67M30a9zX6wh8Z0PbzkdCdPP&fccid=9eea8873d4a8d793&vjs=3",
    "title": "Junior Software Developer (Virtual, Full-time)",
    "description": "WealthCounsel is the premier provider of solutions for estate planners and business lawyers. Our combined offerings of drafting technology, legal education and practice development help attorneys elevate their practices and achieve greater success. We believe in the power of service and the strength of an elite member community that is over 4,000 members strong to make a difference in the lives of our customers and their clients.\nSUMMARY\n\nThe Software Developer designs, develops, and maintains WealthCounsel software applications, along with other staff members. This role performs coding, debugging, testing, and troubleshooting throughout the application development process. The Software Developer contributes to moderately complex aspects of a project.\nEssential Functions\nDevelop, enhance, and maintain web-based applications\nWork closely with a variety of team members to ensure technical compatibility and user satisfaction\nResolve problems with software and respond to suggestions for improvements and enhancements\nProactively learn and utilize new technologies, concepts and procedures as appropriate to project requirements\nProvide estimates for development tasks\nDevelop source code and unit tests according to technical designs\nParticipate in code reviews\nContribute to technical documentation\nParticipate in the Problem Management process and fix issues\nCompetencies\nStrong skills in engineering/programming, analytical/diagnostic/troubleshooting, web technology, and programming methodology\nSolid understanding of systems and subsystems\nStrong understanding of Continuous Integration and Continuous Delivery principles.\nDemonstrated knowledge of applicable software, computer languages, and code, to perform the responsibilities of the role\nDemonstrated aptitude and willingness to learn new technologies and programming languages\nRequired Qualifications and Experience\nBachelor’s of science in computer science or equivalent on-the-job experience.\n2-3 years of experience with Java\n1+ year of experience with Java Script application development\nKnowledge of internet client/server technologies\nExperience with AWS services and agile development is a plus!",
    "company_location": null,
    "company_name": "WEALTHCOUNSEL LLC",
    "pay_range": [
      "80,000",
      "100,000"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=e6c50057fe772cd6&bb=i70XG8Qto-CzJPju7JaIOnfneF3RBKkw0OXUKqG_pLUIHPFBxTtXgsGR0E4V2MKTUPIOt1wLIBlKnnow7cIg6Rjjg4Gcwb-1jjL3Ss5dFw95xR9xb1qhJw%3D%3D&xkcb=SoBK67M30a9zX6wh8Z0ObzkdCdPP&fccid=60636b1decb3597b&vjs=3",
    "title": "Frontend Software Engineer",
    "description": "Q: Why did the edge server go bankrupt?\nA: Because it ran out of cache.\nNow that we’ve got your attention … let’s face it, there are a lot of ugly websites out there. We mean … A. Lot.\nBLOX Digital means to change that. At least on the new products and sites we are creating.\nWe are continually building new products and features and we don’t want ugly. We want beautiful and functional.\nThat’s where you come in.\nWe are expanding our award-winning development staff, and we are looking for top-notch front-end developers. We use a variety of front-end JavaScript libraries combined with a proprietary templating language to output features controlled by our CMS backend. You’ll be adding features and improving already developed code.\nWorking with other developers, designers and product managers, you’ll deliver high quality, highly useable experiences and help build brand consistency. Your work will have a direct impact on users and will be deployed across more than 75+ markets. Along the way, you’ll be working on other industry-changing products in the pipeline.\nTo get us across the finish line, you’ll work to understand the UI requirements; design and support public-facing front end components; configure and deploy applications to development environments; maintain and improve front end performance.\nSound fun?\nIf you have an bachelors degree in Computer Science or (3-5) years experience in a related field with HTML5, CSS3, JavaScript and NodeJS, read on.\n\nWe’re looking for developers with:\nExcellent written and verbal communication skills\nAbility to translate designs and wireframes into markup using modern HTML, CSS and JavaScript to build responsive, performant websites\nExperience building scalable high traffic front-end applications\nAbility to assist customer service teams in troubleshooting issues and provide custom solutions for nonstandard requests\nExperience working with version control systems, deployment workflows, system architects and quality assurance to deliver robust and error free applications\nAbility to refine existing components and libraries to improvement performance and usability\nExperience with modern Web Components, Vanilla JS, Shadow DOM, Fetch API etc. is highly recommend\nAbility to understand business requirements and translate them into technical requirements\nIf this sounds like you, we need to talk.\n\nHere’s what we offer:\nFully remote position\nFlexible time off policy\nVery competitive salary\nGrowth and advancement opportunities\nA great team to work with\nAt BLOX Digital, we look beyond a resume and look at the person. We can’t wait to meet you.\nSalary Range: $80,000 - $95,000\nWhy Join Us?\nBLOX Digital offers competitive wages in a dynamic, interesting work environment with career growth opportunities. We offer an extensive benefit program that can be personalized to your needs. Our benefit program includes medical, dental, vision, short and long-term disability, company provided life insurance and supplemental life insurance. In addition, we offer a 401K retirement plan with company match. We also offer generous paid time off to allow the flexibility to balance personal life and work. This includes paid parental leave for new parents.\nBLOX Digital is a leading digital solutions provider for media organizations across the United States and beyond. Our comprehensive suite of solutions encompasses everything from content management systems to managed digital advertising services, ensuring that you have access to the latest technology and strategies to succeed in today's ever-changing media landscape. BLOX Digital is majority owned by Lee Enterprises.\nLee Enterprises a leading provider of high-quality local news, with 73 markets in 26 states that have print, digital and e-replica versions. We also have a rapidly growing roster of digital products for consumers, and are committed to aggressive digital growth.\nLee Enterprises is proud to be an equal opportunity employer. We respect and celebrate diversity and are committed to creating an inclusive environment for all employees. For more information about Lee, check us out at www.lee.net.\nWe are focused on building a diverse and inclusive workforce. If you are excited about this role but do not meet 100% of the qualifications above, we encourage you to apply.",
    "company_location": null,
    "company_name": "Lee Enterprises",
    "pay_range": [
      "80,000",
      "95,000"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=f5b0342d7321c254&bb=i70XG8Qto-CzJPju7JaIOiNrPsjX8KXfmczdP_Fe0JLO39-9VgBrJDO2FuoRNUBJnKmx6ETIWZoKIeaqy6UZgQSNbWT50odAUtobHNNVhZ3mru9Lc-AXIROgb0TNZL1V&xkcb=SoDX67M30a9zX6wh8Z0NbzkdCdPP&fccid=2294c89076a5a222&vjs=3",
    "title": "Software Developer",
    "description": "Description:\nEmployment Type: Full-time, Exempt, Remote\nCompany Overview\nTradePending develops innovative software solutions for car dealerships, a market leader since 2014. With over 6,000 dealerships as customers across North America, we specialize in connecting dealers and consumers through cutting-edge products that enhance the car-buying experience.\nWorking at TradePending\nAt TradePending, we offer competitive compensation, a comprehensive benefits package, and a dynamic work culture. Our team is passionate, collaborative, and knows how to balance hard work with fun. We value excellence and reward those who bring their best to the table.\nPosition Overview\nWe are looking for a Software Developer to join our team. In this role, you will develop and enhance SaaS products used by thousands of dealerships. If you're a self-driven individual with a strong understanding of the software development lifecycle and want to make an impact on technology that reaches dealerships and consumers globally, we want to hear from you!\nResponsibilities:\nWork closely with senior team members (Principal Architects, Directors) to develop software for new business features.\nWrite, maintain, unit test and improve code based on functional and technical specifications.\nTroubleshoot and resolve code issues, ensuring smooth product performance.\nFollow agile software development processes, collaborating with both onshore and offshore teams.\nParticipate in code reviews to ensure adherence to quality standards and best practices.\nContribute to the development of cloud-based software using .NET, Angular, NodeJS, PostgreSQL, MongoDB, Heroku, Salesforce, and AWS\nContinuously learn and adopt new technologies to improve product functionality.\nDeliver high-quality software aligned with architectural and security standards.\nSome travel (10-25%) may be required.\nRequirements:\nSkills and Experience:\nBachelor’s degree in Computer Science or a related field, or equivalent experience.\n2 to 5 years of hands-on experience in software development and design with increasing project complexity.\nStrong knowledge of software development methodologies and industry best practices.\nProficiency in Node.js, Angular, or similar frameworks (ReactJS, Vue.js)\nSolid experience with web development technologies including HTML and CSS.\nExperience with relational (PostgreSQL, MySQL) and document-oriented databases (MongoDB).\nFamiliarity with RESTful web services and asynchronous processing.\nStrong problem-solving skills and attention to detail.\nAbility to manage multiple priorities and meet deadlines in a fast-paced, remote environment.\nStrong communication and interpersonal skills, with the ability to collaborate effectively across teams.\nAdditional Skills (Nice to Have):\nExperience with DMS and CRM platforms (e.g., Cox/VinSolutions, DealerSocket, DealerAccess) and VIN providers (e.g., DataOne, Polk, VinPower) is a plus.\nFamiliarity with Google Analytics (GA4), Google Tag Manager (GTM), or Google Tag Assistant (GTA), Tealium is a plus.\nKnowledge of SaaS environments and SDLC methodologies (Agile, Scrum, Roadmap, Release) is a plus.",
    "company_location": "Carrboro, NC",
    "company_name": "TradePending LLC",
    "pay_range": null,
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=c0f3aef3baca1a68&bb=i70XG8Qto-CzJPju7JaIOtdHjtEq1jWyOiT3efLcfKdVO0zW5H5CmjdEnX467c_PUKeX-AaDydZttlt-pWQ58zbil6tVVmpXsWVmviFBQA1mTaoxx5zXyAis5-KBB0fW&xkcb=SoBj67M30a9zX6wh8Z0MbzkdCdPP&fccid=2294c89076a5a222&vjs=3",
    "title": "Software Developer",
    "description": "Description:\nEmployment Type: Full-time, Exempt, Remote\nCompany Overview\nTradePending develops innovative software solutions for car dealerships, a market leader since 2014. With over 6,000 dealerships as customers across North America, we specialize in connecting dealers and consumers through cutting-edge products that enhance the car-buying experience.\nWorking at TradePending\nAt TradePending, we offer competitive compensation, a comprehensive benefits package, and a dynamic work culture. Our team is passionate, collaborative, and knows how to balance hard work with fun. We value excellence and reward those who bring their best to the table.\nPosition Overview\nWe are looking for a Software Developer to join our team. In this role, you will develop and enhance SaaS products used by thousands of dealerships. If you're a self-driven individual with a strong understanding of the software development lifecycle and want to make an impact on technology that reaches dealerships and consumers globally, we want to hear from you!\nResponsibilities:\nWork closely with senior team members (Principal Architects, Directors) to develop software for new business features.\nWrite, maintain, unit test and improve code based on functional and technical specifications.\nTroubleshoot and resolve code issues, ensuring smooth product performance.\nFollow agile software development processes, collaborating with both onshore and offshore teams.\nParticipate in code reviews to ensure adherence to quality standards and best practices.\nContribute to the development of cloud-based software using Ruby on Rails, Node.js, React, MongoDB, PostgreSQL, AWS, Salesforce, and Heroku.\nContinuously learn and adopt new technologies to improve product functionality.\nDeliver high-quality software aligned with architectural and security standards.\nSome travel (10-25%) may be required.\nRequirements:\nSkills and Experience:\nBachelor’s degree in Computer Science or a related field, or equivalent experience.\n2 to 5 years of hands-on experience in software development and design with increasing project complexity.\nStrong knowledge of software development methodologies and industry best practices.\nProficiency in ROR, Node.js, ReactJS, or similar frameworks (Angular, Vue.js).\nSolid experience with web development technologies including HTML and CSS.\nExperience with relational (PostgreSQL) and document-oriented databases (MongoDB).\nFamiliarity with RESTful web services and asynchronous processing.\nStrong problem-solving skills and attention to detail.\nAbility to manage multiple priorities and meet deadlines in a fast-paced, remote environment.\nStrong communication and interpersonal skills, with the ability to collaborate effectively across teams.\nAdditional Skills (Nice to Have):\nExperience with DMS and CRM platforms (e.g., Cox/VinSolutions, DealerSocket, DealerAccess) and VIN providers (e.g., DataOne, Polk, VinPower) is a plus.\nFamiliarity with Google Analytics (GA4), Google Tag Manager (GTM), or Google Tag Assistant (GTA), Tealium is a plus.\nKnowledge of SaaS environments and SDLC methodologies (Agile, Scrum, Roadmap, Release) is a plus.",
    "company_location": "Carrboro, NC",
    "company_name": "TradePending LLC",
    "pay_range": null,
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=39b36162fe605e43&bb=i70XG8Qto-CzJPju7JaIOrgNLcN7bOVl6xCWen9g_TTb7hJzWehtu4PGZlA_6lYPPvSGkQ3h2YJc6AN2FAL23Lqs_bDirXZnkBxMDyFw-BkMj0halDfcXg%3D%3D&xkcb=SoCK67M30a9zX6wh8Z0DbzkdCdPP&fccid=3a71a4d2f7990a25&vjs=3",
    "title": "Full Stack Software Engineer",
    "description": "At Allstate, great things happen when our people work together to protect families and their belongings from life’s uncertainties. And for more than 90 years our innovative drive has kept us a step ahead of our customers’ evolving needs. From advocating for seat belts, air bags and graduated driving laws, to being an industry leader in pricing sophistication, telematics, and, more recently, device and identity protection.\nJob Description\nThe Full Stack Software Engineer implements applications following 12-factor principles to build out the product and iterative enhancements. They own the full stack of software products; developing and implementing frontends (web or mobile), and backend services. They leverage test driven development and continuous integration to ensure agility and quality of products. They actively participate in the decision-making process of the team ensuring that the simplest appropriate technology and design is chosen to meet user needs.\nKey Responsibilities:\nParticipates in iteration planning meetings ensuring that the team has a common understanding of each story and chores in the team’s backlog\nParticipates in daily site, cross-site, and product team standups\nParticipates in retrospectives to gather feedback and derive actionable items to improve the team and the product\nCollaborates within the team in designing systems and apps\nPractices daily paired programming and test-driven development in writing software and building products\nEstablishes continuous integration, continuous delivery, and continuous deployment pipelines and practices\nSupport software products in user environments\nParticipates in knowledge sharing\nSupervisory Responsibilities:\nThis job does not have supervisory duties.\nEducation and Experience:\n4 year Bachelors Degree (Preferred)\n1 or more years of experience (Preferred)\nIn lieu of the above education requirements, an equivalent combination of education and experience may be considered.\nCertificates, Licenses, Registrations:\nNo Certification, License or Registration is required for the job.\nFunctional Skills:\nStrong understanding of computer science concepts, object-oriented design principles\nExperience developing software in different programming languages, and demonstrated ability to quickly learn new languages, including but not limited to Java (Spring), .NET, Ruby, Python, Golang, and JavaScript\nExperience in backend development design and implementation; database (relational, NoSQL, caching), messaging and big data development, implementation and optimization\nExperience in responsive web front end / single page application development using modular JavaScript including apps targeted for mobile devices\nHands on experience with modern JavaScript tools such as React, Redux, Webpack, Babel, NPM, and similar technologies\n#LI-CJ1\nSkills\nComputer Science, Continuous Delivery, Go Programming Language, JavaScript, Java Spring, Pair Programming, Python (Programming Language), Ruby (Programming Language)\nCompensation\nCompensation offered for this role is $62,800.00 - 114,175.00 annually and is based on experience and qualifications.\nThe candidate(s) offered this position will be required to submit to a background investigation.\nJoining our team isn’t just a job — it’s an opportunity. One that takes your skills and pushes them to the next level. One that encourages you to challenge the status quo. And one where you can impact the future for the greater good.\nYou’ll do all this in a flexible environment that embraces connection and belonging. And with the recognition of several inclusivity and diversity awards, we’ve proven that Allstate empowers everyone to lead, drive change and give back where they work and live.\nGood Hands. Greater Together.\nAllstate generally does not sponsor individuals for employment-based visas for this position.\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\nFor jobs in San Francisco, please click “here” for information regarding the San Francisco Fair Chance Ordinance.\nFor jobs in Los Angeles, please click “here” for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\nTo view the “EEO is the Law” poster click “here”. This poster provides information concerning the laws and procedures for filing complaints of violations of the laws with the Office of Federal Contract Compliance Programs\nTo view the FMLA poster, click “here”. This poster summarizing the major provisions of the Family and Medical Leave Act (FMLA) and telling employees how to file a complaint.\nIt is the Company’s policy to employ the best qualified individuals available for all jobs. Therefore, any discriminatory action taken on account of an employee’s ancestry, age, color, disability, genetic information, gender, gender identity, gender expression, sexual and reproductive health decision, marital status, medical condition, military or veteran status, national origin, race (include traits historically associated with race, including, but not limited to, hair texture and protective hairstyles), religion (including religious dress), sex, or sexual orientation that adversely affects an employee's terms or conditions of employment is prohibited. This policy applies to all aspects of the employment relationship, including, but not limited to, hiring, training, salary administration, promotion, job assignment, benefits, discipline, and separation of employment.",
    "company_location": null,
    "company_name": "Allstate",
    "pay_range": [
      "62,800",
      "114,175"
    ],
    "job_types": null,
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=fdfb79d8864a56a2&bb=i70XG8Qto-CzJPju7JaIOsh-Tgnyqttwhfm2ldCBNYEXnL7xRqvdT1FJ7iBHCU1Viep0nKE_YsMq1vexEm6T4PakDr_Ras8yCM6_Ce8cv5GCqDAKgM5uULhqcwGDj7e6&xkcb=SoA-67M30a9zX6wh8Z0CbzkdCdPP&fccid=dd54aeb464a854ed&vjs=3",
    "title": "Senior Software Engineer",
    "description": "Who Are We:\n\nWe are COMPLY.\nFor compliance people.\nWe pride ourselves on being the champion for compliance professionals. We help clients navigate the ever-changing regulatory environment by merging technology, consulting, and education; We serve more than 7,000 clients globally through our solutions, and our high-growth organization has been recognized with numerous awards, including Inc. 5000, Institutional Asset Manager Awards, Private Equity Wire Awards, and the Women in Data & Technology Awards.\n\nCome join our growing team of over 300 talented innovators working together to forge the next generation of compliance technology.\n\nTo learn more about COMPLY, visit COMPLY.com\n\nAt Comply, our team is a mix of engineers, open data geeks, and political researchers who are curious, hardworking, and care. Members of our team take a high degree of ownership when it comes to the work we do. We care about what we do and the people we do it with. We’re guided by a deep empathy for our customers and their needs, and we think carefully about how our users - and our world - may be affected by the decisions we make. We’re constantly aiming to drive improvements for our users and build useful things that make our world better. We’re looking for candidates comfortable in a high-growth, fast-paced environment. We value tenacity, a commitment to learning, empathy, humility, ambition, curiosity, and a deep-seated belief in the power of data to inform and improve how things get done and decisions get made.\nWe are looking for a Senior Software Engineer to join our team. The right candidate will not only have the technical expertise in software development but likes to work across different initiatives and thrives in a fast-paced environment. If that sounds like you, we want to meet you!\nResponsibilities:\nLead and mentor junior and mid-level engineers on best practices\nBuild, maintain, and improve end-user applications and APIs in Django and React\nMeasure and optimize application and database performance, including scalability and design\nStrategize with the Product Management team on product and customer facing decisions\nWrite and maintain automated system and integration tests\nWrite clear, modular code with sensible abstractions, promote best practices for application development, and deliver high-quality work on schedule\nCreate and maintain technical documentation on development processes and code\nParticipate in code reviews, provide coaching and feedback to ensure proper design and code quality\nMonitor and suggest emerging technologies where appropriate\nWork in a demanding but highly collegial and collaborative environment\nDevelop an understanding and improve the ecosystem in which software is running\nQualifications:\nPython (minimum 5+ years of experience)\nExperience with a JavaScript framework (Preferably React/Redux), HTML, CSS\nDemonstrated proficiency in OO programming with Python\nDemonstrated capability using Web Application frameworks (Django)\nKnowledgeable in building and consuming microservices\nOO Design and analysis using Design Patterns\nRelational and NoSQL Database designs skills (MySQL, PostgresSQL, ElasticSearch, MongoDB)\nExperience working in an Agile environment\nExperience using Continuous Integration & Continuous Deployment (CI/CD) automation\n\nNice to Have:\nFamiliar with other parts of our stack, including Redis, RabbitMQ, Celery, Jenkins\nBasic experience with networking (TCP/IP, IPv4/IPv6, DNS)\nFamiliar with container technologies (Docker, Kubernetes)\nExposure to Microservices Architecture\nDemonstrated knowledge of .NET Core\n\nThe compensation range for this role is specific to the United States. It takes into account a wide range of factors that are considered in making compensation decisions, including, but not limited to, skill sets, training, licensure and certification, and experience. A reasonable estimate of the base salary range for this role would be $135,000- $150,000 plus applicable bonus/benefits offerings, etc., as those similarly situated within the Company.\nCOMPLY is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity, or national origin. Nothing in this job posting should be construed as an offer or guarantee of employment.\nThe company offers a wide range of perks including:\nComprehensive medical, dental and vision insurance at little to no cost starting on day one\n401k with a company match\nSupplemental benefits at a discounted rate including home, auto and pet insurance\nUnlimited PTO\nProfessional Development reimbursements\nRemote opportunities available for most positions\nTime to get together in person for company happy hours, team offsites and more\nApplicants must be authorized to work for any employer in the United States. Currently, we are unable to sponsor or take over sponsorship of an employment Visa at this time.\nCOMPLY is aware of scammers posing as COMPLY employees and extending job offers via direct messaging, texts and social media platforms. These are fraudulent and should be treated as such. To learn more about this, please review our Statement of Fraudulent Job Offers.",
    "company_location": null,
    "company_name": "COMPLY",
    "pay_range": [
      "135,000",
      "150,000"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=50a41f03353656f1&bb=i70XG8Qto-CzJPju7JaIOgwcKWnHlTbX6OY4E7R_pEv2tSMds0qCHEAv1Zr-CBgBGf-lpawUOWOLMoNWrMGWT6bbQqjDcXVZD9SmZUppG9swferEEIhnArTZ0wl7qhQm&xkcb=SoCj67M30a9zX6wh8Z0BbzkdCdPP&fccid=af7500000d2e8ca9&vjs=3",
    "title": "Software Engineer - Full Stack",
    "description": "Who We Are\nCurbee is the fastest-growing mobile service technology provider. Curbee enables dealerships to offer mobile service with its platform called M.A.R.S. (Mobile and Remote Service). With Curbee M.A.R.S., it's simple: dealerships send the right van to the right job, using the right route with the right parts, at the right time.\nOur street credit is backed by a team of experts from industry giants like Tesla, Lyft, Toyota, and Roadster. With our software, solutions and success team, dealers can scale mobile service quickly, delivering a game-changing customer experience while driving revenue growth. Our innovative technology supports AI-powered scheduling & analytics, ensuring dealers efficiently “go mobile.”\nWe're a scrappy, curious, resourceful team that's united by a “work hard, play hard” mentality. We connect in person often, transferring knowledge, building our culture and learning firsthand in market with our Dealer Partners. We've also been known to travel and seek out the most killer chocolate chip cookies. At Curbee, everyone's an owner, with equity on the table for all. We also offer unlimited PTO, excellent insurance benefits, and a culture built on fun, innovation, and collaboration.\n\n\nWhat You'll Do\nAs a Software Engineer at Curbee, you'll play a vital role in building the future of automotive service. Here's what your day might look like:\nBuild the Future: Contribute to the development of core roadmap features that make our platform exceptional.\nCollaborate & Create: Work closely with senior engineers, product managers, and designers to turn business requirements into technical specs and deliver top-notch software.\nOwn the Stack: Use TypeScript, Node.js, and React within our serverless infrastructure to create and maintain scalable, reliable solutions.\nLearn & Grow: Participate in code reviews, refine your skills, and soak up knowledge in software development, cloud architecture, and third-party integrations like Dealer Management Systems (DMS).\nShape the Team: Bring your ideas, energy, and curiosity to the table to help shape our engineering practices and culture.\nKnow Our Customer: Travel (~10%) to meet customers, gain firsthand insights into their challenges to help build solutions that truly address their needs.\n\n\nWhat We're Looking For\nWe need someone who's more than just a great engineer. You'll succeed at Curbee if you're:\nDriven & Motivated: You bring passion and purpose to everything you do.\nCurious & Creative: You love learning and thrive on solving challenging problems.\nA Team Player: You're fun to work with, collaborative, and all about positive vibes.\nAdaptable: You flourish in a fast-paced, ever-changing startup environment.\nAn Extreme Owner: You take full responsibility for your work and the success of the team.\n\n\nYou're Superpowers\nTechnical Foundation: 2+ years of software engineering experience, with strong JavaScript skills and exposure to TypeScript, Node.js, and React.\nCurious Problem-Solver: You love learning and can tackle complex challenges with creativity and persistence.\nCustomer-First Mindset: You care about delivering solutions that truly meet our customers' needs.\nFull-Stack Know-How: Experience building web applications and a solid grasp of front-end and back-end development principles.\nTeam Player: Strong communication skills and a collaborative spirit—you're fun to work with and thrive in a supportive team.\nBonus Points for\nFamiliarity with cloud platforms like AWS or Google Cloud and interest in serverless architecture.\nKnowledge of RESTful APIs, data modeling, and integrating third-party systems.\nPassion for the automotive industry or experience with dealer tools and dealer management systems (DMS).\nBeing based in Dallas, LA, or the Bay Area.\nLoving chocolate chip cookies.\nWhat You'll Get\nA competitive salary, equity ownership (because we're all in this together), unlimited PTO, comprehensive benefits, and the chance to make a massive impact in a small, fast-moving team.\nIf you're highly motivated, love tackling big challenges, and want to build a future you can be proud of (while sneaking in a cookie or two), we'd love to chat.\n\n\nThe salary range reflects competitive compensation and will vary based on experience, skills, and location.",
    "company_location": null,
    "company_name": "Curbee",
    "pay_range": [
      "120,000",
      "160,000"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=562b11548fb538bb&bb=i70XG8Qto-CzJPju7JaIOog1iY4ItAVvAVY0PPsvEdOnN9CudI2dqpyst-_u8ur81D9aXU48o80ufEibKBgmKN1M3DDqfUgro3olxfDThqF2L19iv92Spg%3D%3D&xkcb=SoAX67M30a9zX6wh8Z0AbzkdCdPP&fccid=2533ecec90dc66a3&vjs=3",
    "title": "Software Developer",
    "description": "Software Developer\nThis position is 100% remote/work from home.\nU-Haul is searching for a talented Software Developer to join our team. Come join a stable and ever-expanding IT organization to be part of the quest to elevate us to the next level.\nAbout the Job :\nThe position is with a software development team that develops and maintains a suite of company-critical enterprise applications and APIs used by numerous U-Haul business teams and thousands of U-Haul field locations. Every member of the team makes important contributions which have a direct and significant impact on U-Haul’s business operations.\nWe have recently transitioned to supporting both in-office and 100% work from home (remote) employment. In this regard, we have strived to maintain and build upon a positive work environment which emphasizes close collaboration amongst team members and with business teams across U-Haul.\nAbout You :\nWe are looking for a full-stack software developer who is highly skilled in the ability to apply critical thinking and structured programming fundamentals to real world problems. U-Haul uses the Microsoft development stack (e.g., C#, MVC, SQL, Entity Framework, HTML 5, CSS, Web API, jQuery, ASP.Net, and T-SQL), along with non-Microsoft supporting technologies (like Apache Kafka, SPAs, Reddis, etc.) to solve its business problems. We do this through technologies such as web apps and web APIs, and various types of backend persistence, including SQL. The right candidate does not need to have previous experience with the Microsoft technology stack to learn and succeed.\nThe primary roles and responsibilities of this position include the following:\nWrites code that is easily maintainable, highly reliable and demonstrates knowledge of common programming best practices.\nWith some supervision and oversight, complete moderately complex development tasks on time and with high quality.\nIs continually striving to learn applicable technologies to the job and rectify deficits in their technical knowledge that stops them from being able to contribute when needed.\nStays current with current software architecture and system design concepts.\nIs proactive and shows urgency and does what is necessary to get the job done and cares about impacts to our customers.\nRespond quickly and effectively to production issues and take responsibility for seeing those issues through resolution.\nPossess strong communication skills and can communicate complex technical problems in a manner non-technical people can understand.\nCoordinate with QA, Ops, and other Development Teams effectively.\nFamiliar Agile and Scrum methodologies\nWhy Should You Apply?\nCompetitive Compensation\nPotential for work from home and flexible work schedules\nLatest technologies\nTeam that Emphasizes Collaboration\nPositive Team Culture founded by team self-organization principles.\nExperience/Education/Training:\n4+ years of professional software development experience\nHave a strong background with C#, .NET Framework, .NET Core, ASP .NET MVC, SQL\nPreferably possess knowledge of these technologies: React, Kafka, Redis\nBachelor’s degree in computer science or related field or additional compensatory experience\nMust be a U.S. citizen or have proof of U.S. employment authorization for this position.\nAbout U-Haul IT Team :\nU-Haul is heavily investing in transforming our applications and reporting systems to a hybrid cloud architecture model. The company culture is one of high team-orientation, that loves to dig in and learn new technologies, and help teammates be the best they can by constant learning, coaching and process improvement.\nU-Haul provide robust wellness benefits, events and resources to help team members becomes the happiest and healthiest they can be. These include, but are not limited to, a “get fit” reimbursement program for gym memberships, a healthy café at our corporate campus and wellness fairs. For a complete summary of U-Haul’s benefits and wellness programs, please see the benefits page on our career site: https://jobs.uhaul.com/Benefits\nAMERCO and its family of companies, including U-Haul, have strived to create a culture of health and wellness. As of February 1, 2020, and consistent with applicable state law, no AMERCO or U-Haul company will hire individuals in states where it may lawfully decline to hire individuals who use nicotine products. By continuing with this application, you are indicating that, if hired, you consent to nicotine screening in the future. This policy will not apply to team members hired before February 1, 2020.\nU-Haul Offers:\nFull Medical Coverage\nPrescription plans\nDental & Vision Plans\nRegistered Dietitian Program\nGym Reimbursement Program\nWeight Watchers\nVirtual Doctors’ Visits\nCareer stability\nOpportunities for advancement\nValuable on-the-job training\nTuition reimbursement program\nFree online courses for personal and professional development at U-Haul University®\nBusiness travel insurance\nYou Matter Employee Assistance Program\nPaid holidays, vacation, and sick days\nEmployee Stock Ownership Plan (ESOP)\n401(k) Savings Plan\nLife insurance\nCritical Illness/Group Accident\n24-hour physician available for kids\nMetLaw Legal program\nMetLife auto and home insurance\nMindset App Program\nDiscounts on cell phone plans, hotels, and more\nLifeLock Identity Theft\nSavvy consumer wellness programs - from health care tips to financial wellness\nDave Ramsey’s SmartDollar Program\nU-Haul Federal Credit Union\nCompensation: $60,000.00 to $90,000.00\n\n\n\nU-Haul is an equal opportunity employer. All applications for employment will be considered without regard to race, color, religion, sex, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, provincial, state, or local law. Individual accommodations are available on requests for applicants taking part in all aspects of the selection process. Information obtained during this process will only be shared on a need to know basis.\n\nAbout Us\nSince 1945, U-Haul has been serving do-it-yourself movers and their households. Like many other successful ventures, the concept for U-Haul was generated out of need. After World War II, there existed the widespread need for do-it-yourself moving equipment that would be available on a one-way, nationwide basis.\nU-Haul co-founders L.S. \"Sam\" Shoen and his wife, Anna Mary Carty Shoen, recognized that need and acted upon it. Their visionary approach spread the cost of ownership among many users, facilitating the mobility of the populations of the U.S. and Canada. The covered wagon of the pioneers morphed into orange U-Haul trailers. In the process, an industry was born.\nU-Haul Holding Company and its family of companies, including U-Haul, have strived to create a culture of health and wellness. As of February 1, 2020, and consistent with applicable law, no U-Haul Holding Company or its family of companies will hire individuals in states where it may lawfully decline to hire individuals who use nicotine products (Alabama, Alaska, Arizona, Arkansas, Delaware, Florida, Georgia, Hawaii, Idaho, Iowa, Kansas, Maryland, Massachusetts, Michigan, Nebraska, Pennsylvania, Texas, Utah, Vermont, Virginia and Washington). This policy will not apply to team members hired before February 1, 2020.",
    "company_location": null,
    "company_name": "U-Haul",
    "pay_range": [
      "60,000",
      "90,000"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=3d26dad670ecf531&bb=i70XG8Qto-CzJPju7JaIOlRZacp_DvByHDZnGZAhxdEiQeldpF40adB3rbcfnWcWQAbrcZMBeYZ4WTwEb22f2jT7QOjFHIi_eYTAEQzvWvW1z5iGhD5e7MmkJk7b_6M3&xkcb=SoCZ67M30a9zX6wh8Z0HbzkdCdPP&fccid=74e36d81c894b4b7&vjs=3",
    "title": "Software Engineer Specialist",
    "description": "Position Type :\nFull time\nType Of Hire :\nExperienced (relevant combo of work and education)\nEducation Desired :\nBachelor of Computer Science\nTravel Percentage :\n0%\nJob Description\nAbout FIS\n\nWe are FIS. Our technology powers the world’s economy and our teams bring innovation to life. We champion diversity to deliver the best products and solutions for our colleagues, clients and communities. If you’re ready to start learning, growing and making an impact with a career in fintech, we’d like to know: Are you FIS?\nCurrent and future sponsorship are not available for this position\nAbout the Role\n\n\nThe Software Developer Specialist will play a critical role in delivering innovation and growth for the Banking Solutions business by helping to drive the technical direction and modernization of our largest retail banking application.\n\nYou will be responsible for collaborating with a team of engineers to define standards and drive modernization of this application to support FIS’s business goals, while continuing to support our current applications, considering code quality, performance, and security. Your technical expertise and collaboration will help ensure the success of our retail application and contribute to the overall growth of the company.\n\nWhat you will be doing\nGuide the development team in transitioning our existing Angular/Cordova mobile application to React Native and our Angular web codebase to React.\nCollaborate closely with product managers, UX/UI designers, backend developers, QA and other stakeholders to understand business requirements and translate them into technical solutions.\nCreate and implement coding standards for mobile and web applications within the Digital domain to ensure scalable, robust and maintainable code.\nContribute to continuous improvement / delivery initiatives in our development processes, tooling, and automation to enhance efficiency, quality, and time-to-market.\nAnalyze and provide feedback on proposed third-party tools, frameworks, and APIs, considering factors such as security, performance, and scalability.\nCollaborate with internal technical teams to align on API contract definition and platform component integration.\nCommunicate complex technical concepts and technical decisions effectively to both technical and non-technical stakeholders, including peers, team members, senior management, business stakeholders and external partners.\nStay up to date with industry trends, emerging technologies, and regulatory changes in the FinTech sector, and advocate to incorporate changes into the mobile and web applications as needed.\n\nWhat you Bring\nExtensive experience developing web and mobile applications, particularly within the financial technology (FinTech) domain.\nExpert proficiency in React, React Native, and Angular.\nDeep understanding of mobile application software architecture patterns. (e.g., MVC, MVVM, Clean Architecture) and design patterns. (e.g., SOLID, DRY)\nKnowledge of secure coding practices, encryption algorithms, GDPR and PCI-DSS compliance and data protection mechanisms relevant to handling sensitive financial data in mobile and web applications.\nUnderstanding of financial products, payment systems, banking protocols, and industry trends, enabling the design of applications that meet both user needs and regulatory guidelines.\nHands-on development experience with FinTech projects such as banking applications, investment platforms, payment gateways, or financial analytics tools, with a focus on usability, security, and innovation.\nExpertise in performance optimization, scalability, and troubleshooting of web and mobile applications to ensure optimal user experience, reliability and responsiveness.\nProficiency developing accessible websites that adhere to WCAG standards.\nFamiliarity in collaborating with global development teams (including India) and matrixed organizations.\nPreferred degree in Engineering, Computer Science, or similar relevant field.\n\nBonus if you have\nTransitioned a codebase from Angular to React Native and Angular.js to React.js.\nExperience building and maintaining a white label mobile application and/or SaaS product that is branded and released for multiple clients.\nFull-stack web development experience with Node.js, ExpressJS, and/or GraphQL.\nA clear perception of core AWS services uses and basic AWS architecture best practices.\nProficiency in developing, deploying, and debugging cloud-based applications using AWS Lambda.\nProficiency in using AWS service APIs AWS CLI and SDKs to write applications.\nKnowledge in using CI/CD pipeline to deploy applications on AWS.\nMastery in writing code for serverless applications.\n\nWhat we offer you\nA voice in the future of fintech.\nAlways-on learning and development.\nCollaborative work environment.\nOpportunities to give back.\nCompetitive salary and benefits.\n\nFIS is committed to providing its employees with an exciting career opportunity and competitive compensation. The pay range for this full-time position is $123,810.00 - $207,980.00 and reflects the minimum and maximum target for new hire salaries for this position based on the posted role, level, and location. Within the range, actual individual starting pay is determined by additional factors, including job-related skills, experience, and relevant education or training. Any changes in work location will also impact actual individual starting pay. Please consult with your recruiter about the specific salary range for your preferred location during the hiring process.\nPrivacy Statement\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.\nEEOC Statement\nFIS is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, genetic information, national origin, disability, veteran status, and other protected characteristics. The EEO is the Law poster is available here supplement document available here\n\nFor positions located in the US, the following conditions apply. If you are made a conditional offer of employment, you will be required to undergo a drug test. ADA Disclaimer: In developing this job description care was taken to include all competencies needed to successfully perform in this position. However, for Americans with Disabilities Act (ADA) purposes, the essential functions of the job may or may not have been described for purposes of ADA reasonable accommodation. All reasonable accommodation requests will be reviewed and evaluated on a case-by-case basis.\nSourcing Model\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n#pridepass",
    "company_location": null,
    "company_name": "FIS Global",
    "pay_range": [
      "123,810",
      "207,980"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=28069f7fa631f6f7&bb=i70XG8Qto-CzJPju7JaIOkLCWyPQBh6YnAZ3aSfOsD_5xodC8OHA0TLk094u0CU1t-vH-J_mOsDMk4lktmd-PxPvanx1HMvHAruV1gS7aigc6C9fknlW4T5VrCjdfZaT&xkcb=SoAt67M30a9zX6wh8Z0GbzkdCdPP&fccid=c060d0df634ace82&vjs=3",
    "title": "Software Engineer_IT",
    "description": "Software Engineer\n\nSoftware Engineer\n\nWho are we?\n\nVersant Health is one of the nation’s leading administrators of managed vision care, serving millions of our clients’ members nationwide. We are driven by our mission to help members enjoy the wonders of sight through healthy eyes and vision.\n\nAs a Versant Health associate, you can enjoy a comprehensive Total Rewards package, which includes health and dental insurance, tuition reimbursement, 401(k) with company match, pet insurance, no-cost-to-you vision insurance for you and your qualified dependents. We are also invested in your success. There are many opportunities for advancement and development throughout all stages of your career with us.\n\nSee how you can make a difference with the support of strong leadership and a team environment.\n\nSee Everything, Be Anything™.\n\nWhat are we looking for?\n\nThe role of the Software Engineer is to develop and maintain highly scalable and efficient software and applications that meet or exceed end-user specification and IT system objectives to enable Versant Health business objectives. The ideal candidate will have experience in various technologies our web sites/mobile applications and multiple web service layers are implemented with. Candidates with experience with .net MAUI based mobile applications and .net core 8 web service back ends highly preferred. Must demonstrate the ability and initiative to debug complex multi-tiered applications, and show the ability to create use cases in a de-identified development environment. The ability to produce stable bug free code following DRY coding patterns and thoroughly test all code changes in a development environment will be paramount to your success.\n\nWhere you will have an impact\nParticipate in requirements elaboration and solution design sessions with business stakeholders and product managers to drive better end user experiences and resilient applications\nCollaborate with and across IT teams to build, deploy and support in full stack developments tools and technologies\nRoutinely refactor applications to strengthen security posture, leverage latest technology frameworks, and improve user and software performance\nAdhere software deliverables to Versant Health architectural guidelines and IT operational objectives\nCoordinate with Project Manager and Product Managers to develop level of effort estimates and work plans to achieve project and business milestones\nDevelop and maintain software documentation in accordance with software lifecycle best practices for design, coding, deployment, and production support\nAssist in cross training and/or knowledge transition document and transition for software maintenance and monitoring responsibilities\nCollaborate in and adhere to Agile delivery methodology ceremonies\nParticipate in any/all training and educational activities necessary to fulfill at least the minimum requirements as specified within your departmental goals.\nOn-call availability as required\nOther duties as assigned\nWhat’s necessary to do the job?\n\nPreferred bachelors or master’s degree in Computer Science, Information Systems, or related field or equivalent combination or experience and education.\nFive (5) plus years of full stack development experience, or equivalent\nC#, Dapper\nKnowledge and experience with the following Web technologies: Classic ASP, .NET MVC, Knockout\nKnowledge and experience with the following web service technologies: NET Core Microservices\nKnowledge and experience with API security proxies such as Axway Gateway\nKnowledge and experience with the following mobile application technologies: Xamarin, .net MAUI\nProficiency in SQL, database modeling and database optimization skills.\nProficiency in point-to-point integrations and Restful, SOAP web service interfaces\nFamiliarity with Git/Bitbucket, Octopus, and Team City preferred.\nSaFe Agilist certifications is a plus\nKnowledge and experience in the insurance, health, or vision care industry preferred\nHIPAA & Security Requirements\n\nAll Associates must comply with the Health Insurance Portability Accountability Act of 1996 (HIPAA) as it pertains to disclosures of protected health information (PHI) as described in the Notice of Privacy Practices and HIPAA Privacy Policies and Procedures. As a component of job roles and responsibilities, Associates may have access to covered information, cardholder data or other confidential customer information which must be protected at all times. As a result, Associates must explicitly adhere to all data security guidelines established within the Company’s Privacy & Security Training Program.\n\nVersant Health will never request money from candidates who seek employment with us and will never ask for any payment as part of the recruitment process.\n\nVersant Health is a proud Equal Employment Opportunity and Affirmative Action employer dedicated to attracting, retaining, and developing a diverse and inclusive workforce. All qualified applicants will receive consideration for employment at Versant Health without regards to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity or expression, age, disability, national origin, marital or domestic/civil partnership status, genetic information, citizenship status, uniformed service member or veteran status, or any other characteristic protected by law.\n\nThe wage range for applicants for this position is [$110,000.00 to $120,000.00].\n\nAll incentives and benefits are subject to the applicable plan terms.",
    "company_location": null,
    "company_name": "Versant Health",
    "pay_range": [
      "110,000",
      "120,000"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": "On call",
    "work_setting": "Remote"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=debb794e317f6bc9&bb=i70XG8Qto-CzJPju7JaIOop50wfESW9Y-NyKQ1ji3Pt_n4VA7cUWW2HG5FO2Jg5TCcBGYkHHPH6FdIM7_US0qYZzm3HeaXbwNhqZOO9DavU_4H1S3WygvZ1CgYLo3nty&xkcb=SoCw67M30a9zX6wh8Z0FbzkdCdPP&fccid=5abbd6e84bf247cc&vjs=3",
    "title": "Software Engineer, Product (Los Angeles Remote)",
    "description": "Build and enhance the product that powers better access to banking\n\nThe Prelim team is seeking a Software Engineer, Product to join our (small, but growing!) team. As a member of our team, you will have the opportunity to help increase access to banking for millions of people. If you're passionate about engineering and eager to be part of a fast-paced remote startup culture, we encourage you to apply to join our team today!\n\nAs a Software Engineer, Product at Prelim, you will be responsible for designing, building, and optimizing the platform that powers digital account opening for banks across the world. You will work closely with Prelim's customers, designers, and product stakeholders to develop innovative solutions that enhance user experiences and meet the complex needs of banks and their customers.\nKey Responsibilities:\nWork across the entire stack, from React to Node.Js to PostgreSQL.\nPlan, shape and build new features and enhancements.\nUnderstand banks and their customers, and every financial service from deposit accounts to loans to treasury services.\nDeliver a platform that is accessible, reliable, scalable and optimized for banks and their customers across the world.\nQualifications:\nThoughtful problem-solving: For you, problem-solving starts with a clear and accurate understanding of the context. You can decompose tricky problems and work towards a clean solution, by yourself or with teammates. You're comfortable asking for help when you get stuck.\nPragmatism and impact-orientation: You care about business impact and prioritize projects accordingly. You're not just going after cool stuff—you understand the balance between craft, speed, and the bottom line.\nPutting users first: You think critically about the implications of what you're building, and how it shapes real people's lives. You understand that reach comes with responsibility for our impact—good and bad.\nEmpathetic communication: You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time. In disagreements, you engage thoughtfully with other perspectives and compromise when needed.\nTeam player: For you, work isn't a solo endeavor. You enjoy collaborating cross-functionally to accomplish shared goals, and you care about learning, growing, and helping others to do the same.\n$100,000 - $120,000 a year\nAbout Prelim:\n\nPrelim is a cutting-edge software provider that specializes in customer onboarding for banks. Our platform is designed to streamline the account opening process for both consumers and businesses, increasing speed-to-market and improving the customer experience.\n\nWe pride ourselves on being a forward-thinking and innovative company, always on the lookout for new ways to improve our offerings and stay ahead of the curve in the banking industry. Our small team is made up of passionate and dedicated individuals who are committed to delivering exceptional results for our clients.\n\nAs a member of the Prelim team, you will have the opportunity to work with cutting-edge technology and be at the forefront of the digital account opening industry. You will have the chance to work with a diverse range of clients, including some of the biggest names in the banking industry, and have an outsized impact.\n\nWe offer a fast-paced and dynamic work environment, with ample opportunities for growth and advancement. If you're excited to be part of a team that is shaping the future of the banking industry, then we encourage you to apply to join us at Prelim. We are looking for individuals who are driven, ambitious, and excited about the opportunity to make a real impact in the digital account opening industry.\n\n#LI-Remote",
    "company_location": "Los Angeles, CA",
    "company_name": "Prelim",
    "pay_range": [
      "100,000",
      "120,000"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote"
  }
]