[
  {
    "url": "https://www.indeed.com/rc/clk?jk=660b59110c77475b&bb=6s3U0kDsA49dGpPMR6Y78O-r8VIMLklTfl24My7fECKD-HeJyTurn1mFy6c7EOCzCPUexijL0TZhcb5n3terxnwUKwSuaOjaPDdM7JkSsFEfi_TbLvmAF_qswFy473yn&xkcb=SoCH67M30YXLcnSkMB0LbzkdCdPP&fccid=3a9be3d817592bbc&cmp=Nu-expression&ti=Front+End+Developer&vjs=3",
    "title": "Front-End Web Developer",
    "description": "Overview:\nAs a front end developer, you will be responsible for developing new user-facing features, translating the structure and design of web pages into actual code that will produce visual elements, building reusable codes, applying CSS, and using a variety of markup languages to create the web pages. You will work with the Director of User experience and bridge the gap between the website designs and technical implementation.\nResponsibilities:\nThe essential functions include, but are not limited to the following:\nTranslate Figma web page designs into usable, responsive code\nBuild and edit web pages using drag-and-drop page builder design tools maintaining responsiveness, accessibility, and design integrity across various screen sizes.\nBuild reusable code and libraries for future use\nEnsure the technical feasibility of UI/UX designs\nCollaborate with other team members\nWriting website code with programming/markup languages such as HTML, CSS, Javascript, and JQuery to create user-friendly web pages\nProducing, maintaining and modifying websites and user interfaces\nIncorporating applications, graphics, audio and video clips into client websites\nEnsuring websites are accessible across many platforms, including laptops and smartphones\nRoutinely testing websites for ease of use, speed, validity of links, and other quality factors\nFixing any website issues or bugs that arise\nCollaborate with back-end developers and web designers to improve usability\nStay up-to-date on emerging technologies\nDeveloping features to enhance the user experience.\nSkills:\nFront-End Customization - Modify and enhance existing websites by writing pure CSS, HTML, and JavaScript/Query without relying on modern frameworks.\nDeep CSS Expertise - Implement pixel-perfect designs, resolve cross-browser compatibility issues, and work with complex layouts, animations, and responsive behavior.\nJavaScript & Query Mastery - Develop interactive components, modify DOM elements dynamically, and handle AJAX requests efficiently using native JavaScript and Query.\nCode Debugging & Optimization - Analyze and troubleshoot front-end issues, optimize page performance, and ensure accessibility and usability across different platforms.\nSeamless Integration - Customize third-party widgets, embed scripts, and modify website behavior without disrupting existing functionality.\nBasic knowledge of backend coding languages (e.g. Java, JavaScript, PHP, etc) and frameworks/systems.\nSelf-sufficient, resourceful problem solver with strong attention to detail—able to take minimal direction, document instructions, proactively identify and fix issues, and seek guidance only after thorough troubleshooting.\nWorks well with deadlines and can easily manage time while communicating priorities and expectations to a variety of collaborating team members.\nBasic understanding of Web Content Accessibility Guidelines (WCAG)\nComfortable working remotely and independently, and have the time management and self discipline to get things done in a fast-paced environment with clients and team members across time zones\nAre not the kind of person who needs to have their work checked or be micromanaged (you always send client-ready work)\nJob Type: Full-time\nBenefits:\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nSchedule:\nMonday to Friday\nWork Location: Remote",
    "salary": "Full-time",
    "job_details": "Job details\nJob type\nFull-time\nShift and schedule\nMonday to Friday\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=e3fa8eeaa2b3f974&bb=6s3U0kDsA49dGpPMR6Y78DwyKqRlji_b30LcmZItB69G5ql6AVw2fyZ42aIz04WGJxjiDh1RYLnn1LQQhj4zo1JAewrV9U578t4yYTtUNsQH5VY3PH8kaKafOWrdHxsV&xkcb=SoAz67M30YXLcnSkMB0KbzkdCdPP&fccid=044076f542c2a482&vjs=3",
    "title": "Engineer II - Front-End Foundations",
    "description": "Engineer II - Front-End Foundations\nUS (Remote); #LI-Remote\nAbout HashiCorp Front-end Experiences\nThe Front-End Experiences organization at HashiCorp exists to enable and support the engineering and design delivery of accessible, high-quality UIs through a focus on tooling, infrastructure, design systems, education, and culture. The organization is responsible for Helios, HashiCorp's design system, our accessibility program, the long-term reliability and stability of our UIs, and more. The organization acts as a center of excellence to support the front-end engineers and designers across all of HashiCorp R&D.\nAbout the role\nAs a member of Front-end Experience's Foundations team, you will help support the long-term reliability and stability of our front-end UIs focused on things like security, and dependency management, developer experience, and driving consistent UI engineering processes between products, serving to enable their focus on delivering product features\nWhat you'll do (responsibilities):\nIdentify and act on opportunities to leave our product UIs better than you found them\nContribute to dependency upgrades and tooling changes. Help update applications to use the latest Ember.js patterns, improve performance, and modernize codebases.\nAdoption of HashiCorp Design System in our applications and layout patterns to enhance UI consistency and performance.\nTake the initiative to lead medium-sized frontend projects. Work collaboratively with team members to plan, execute, and deliver solutions. Actively participate in design and architecture discussions.\nStrive for quality through maintainable code and comprehensive testing from development to deployment.\nWhat you'll need (basic qualifications):\nHave production experience working on an application using a JavaScript framework (e.g. Ember.js), building responsive layouts with CSS and HTML\nBe familiar with web accessibility standards and inclusive design principles\nStrong collaboration skills and an ability to build productive relationships with a diverse range of partners\nCommunicate clearly while remaining empathetic and kind\nHave an eagerness to learn through humility and reflection\nWhat is our hiring process like?\nThe below serves as a basic outline; we may choose to add or remove steps based on the information that we gather during the process.\nIntroductory Call with someone from our recruiting team\nFirst Interview with the Hiring Manager\nInterview Loop with additional team members that touch on the following:\nCode Review Exercise\nPair Programming Exercise\nCommunication & Collaboration\nAlthough we use Ember.js at HashiCorp, our interviews are available in Ember or React. The use of AI during interviews is prohibited.\n\"HashiCorp is an IBM subsidiary which has been acquired by IBM and will be integrated into the IBM organization. HashiCorp will be the hiring entity. By proceeding with this application you understand that HashiCorp will share your personal information with other IBM subsidiaries involved in your recruitment process, wherever these are located. More information on how IBM protects your personal information, including the safeguards in case of cross-border data transfer, are available here: link to IBM privacy statement.\"",
    "salary": "$151,300 - $178,000 a year",
    "job_details": "Job details\nPay\n$151,300 - $178,000 a year\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=177b6e1922cdfeb6&bb=6s3U0kDsA49dGpPMR6Y78ALIODEvrqjsTwK90ksYD5f2fak8bF0eEIBj6fgU2ylxKl99MOvYC6YgoqybDk0BetkSI5w4eEmis-SHrJ6w20MeEjumolGPNknmfPZfWydD&xkcb=SoCu67M30YXLcnSkMB0JbzkdCdPP&fccid=083cb6e61819088a&cmp=First-Choice---Nationwide-Property-%2526-Appraisal-Services&ti=Senior+Software+Engineer&vjs=3",
    "title": "Sr. Software Engineer",
    "description": "Overview\nNationwide Property & Appraisal Services (NPAS) is a national appraisal management company providing valuation services to lending institutions and to federal government agencies. We are dedicated to excellence and committed to delivering value to our clients. We seek a Senior Level Software Engineer to develop web-enabled .NET and MSSQL backend applications used in the real estate services industry. This position requires a minimum of seven years of experience building leading-edge enterprise applications. The successful candidate will possess strong analytical, design, and implementation skills. A detailed-oriented self-starter with excellent communication skills and the ability to lead and participate in technical discussions on complex issues and their solutions. Must be a team player dedicated to ensuring the success of the team. In addition, the candidate must be organized, personable, thorough, and self-motivated. Work will be in a fast-paced, customer-driven environment that requires learning quickly and working both independently and collaboratively.\nPrimary Duties:\nPerform coding and other related software development tasks, per project requirements.\nEstimate development efforts and plans for assigned projects.\nActively participate as a team member in the Scrum process.\nPerform assignments to acceptable department standards and best practices.\nParticipate in design and code reviews.\nInterpret business requirements, expressed as written feature requirements, business rules, acceptance tests, or otherwise documented.\nCreate and maintain SQL stored procedures and scripts.\nProvide tracking and status update reports in a timely fashion.\nInvestigate, diagnose, and provide resolution of software problems.\nCreate, document, and perform unit testing.\nProvide support for product deployment during non-business hours.\nPerform other related duties as assigned.\nQualifications:\nBachelor’s degree in a related field or commensurate experience.\nSeven plus years of development experience, building large-scale web applications.\nAbility to translate business requirements into technical specifications.\nAt least seven years of development experience with C#, .NET Framework, and ASP.NET MVC.\nStrong programming skills in object-oriented and web technologies, including HTML, CSS, and JavaScript/jQuery.\nAt least five years of SQL-based database development experience.\nEffective written and verbal communication skills.\nA positive attitude and professional disposition.\nNice to Have:\nExperience in real estate or related industry.\nExperience with GIT, TFS and Azure Dev Ops.\nExperience with.NET Core 6 and Entity Framework Core.\nKnowledge of Scrum or other Agile methodologies.\nPhysical Requirements:\nProlonged periods of sitting (up to 7 hours) at a workstation operating a PC.\nHeavy data entry (large amount of typing on a keyboard and repetitive motion with a mouse).\nFocusing/looking at a computer monitor for long periods.\nReading documents in print and electronically.\nBending, twisting, and stooping are required regularly.\nUse of a telephone to make and receive calls.\nJob Type: Full-time\nPay: $95,000.00 - $151,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid holidays\nPaid time off\nWork from home\nApplication Question(s):\nDo you live in the United States? If so, Please provide the state you reside.\nEducation:\nBachelor's (Required)\nWork Location: Remote",
    "salary": "$95,000 - $151,000 a year - Full-time",
    "job_details": "Job details\nPay\n$95,000 - $151,000 a year\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=3d573b0bcb1f28c7&bb=6s3U0kDsA49dGpPMR6Y78KuQrWzDZUDaggaFjM5T0D7poG7GAnAM7InUzllYay18wCMVrIhFfYkwdJaohJi4XHlBtdcHRqbfkahjSNJkQyfnurBVLXox_l74C-gUqiiiQJeTIVhFIfg%3D&xkcb=SoAa67M30YXLcnSkMB0IbzkdCdPP&fccid=99260f79da3425d2&cmp=Alpha-Terrace%2C-LLC&ti=Full+Stack+Developer&vjs=3",
    "title": "Full-Stack Developer—Contract Position",
    "description": "Seeking an experienced full-stack developer initially for an EPA funded project with the potential for more projects if things work out. You will be working with a senior developer, and will be provided with mentorship and training, however most of the work will be done indepentantly so having good time management skills and the ability to work without much oversight is extremely important! Must be experienced with PHP, MySQL, JavaScript, and ReactJS. API experience with the SLIM framework would be a huge plus but not required, some API experience is required though.\nResponsibilities\nDevelop and maintain web applications using PHP, React.js, and MySQL, ensuring high performance and responsiveness.\nCollaborate with UX/UI designers to implement user-friendly interfaces and enhance overall user experience.\nParticipate in Agile and Scrum methodologies to deliver projects on time and within scope.\nWrite clean, maintainable code and conduct code reviews to ensure quality standards.\nIntegrate with RESTful APIs and manage database interactions effectively.\nStay updated with emerging technologies and best practices in software development.\nRequired Experience\nExperience with Linux\nExperience with Apache webserver\nExperience using a MySQL database\nExperience programming in PHP\nSome level of experience with either AngularJS or ReactJS\nUI, UX, interactivity design experience a huge plus\nBasic understanding of UI/UX design and what a user friendly experience should look like\nExperience in making architectural recommendations (wireframes will be provided)\nPrior experience with Scrum and Agile development\nJIRA knowledge is a plus\nExperience with GIT source control\nTo be a best fit for this project you need:\nAbility to communicate clearly\nDedication to meet project deadlines in a timely manner\nWillingness to enter into a non-compete agreement\nPlease respond with your resume if you would like to be considered for this job.\nJob Type: Contract\nPay: $45.00 - $55.00 per hour\nExpected hours: 25 – 35 per week\nBenefits:\nFlexible schedule\nWork from home\nSchedule:\nMonday to Friday\nEducation:\nBachelor's (Required)\nExperience:\nFull-stack development: 2 years (Required)\nWork Location: Remote",
    "salary": "$45 - $55 an hour - Contract",
    "job_details": "Job details\nPay\n$45 - $55 an hour\nJob type\nContract\nShift and schedule\nMonday to Friday\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=13fb09a0d4467c1f&bb=6s3U0kDsA49dGpPMR6Y78MgypnsFM9SKZnX3-tkexJaQYkF3HzCV0q8-ltFYbVd956Tk_xMP4s1lxXajqK90DntFIvpiQQqTXVQluB539RPjfm5mjNKPUzIiD-S25yP5&xkcb=SoCU67M30YXLcnSkMB0PbzkdCdPP&fccid=5362a19c14400543&vjs=3",
    "title": "Full Stack Software Engineer",
    "description": "We are a dynamic and growing team focused on building cutting-edge software solutions. Our team thrives on innovation, collaboration, and the ability to scale quickly. We are seeking a skilled Full Stack Developer to join our team and help drive the development of our web applications, APIs, and cloud solutions.\n\nJob Description:\nWe are looking for a talented Full Stack Developer with experience in AWS/Azure cloud environments, front-end and back-end web development, and API integrations. The ideal candidate will be proficient in React/Next.js, MSSQL/Postgres, and .NET, and have a strong understanding of OAuth providers and API integrations.\n\nResponsibilities:\nDesign, develop, and maintain scalable, high-performance web applications using React and Next.js.\nImplement secure, robust, and scalable API integrations using RESTful APIs, OAuth, and third-party services.\nBuild and optimize backend services with .NET, MSSQL, and Postgres.\nCollaborate with cross-functional teams to deliver innovative and impactful solutions.\nManage and deploy applications on AWS or Azure environments.\nEnsure code quality through testing, code reviews, and documentation.\nTroubleshoot, optimize, and enhance application performance and scalability.\nRequirements:\nStrong experience with React, Next.js, .NET, and cloud platforms (AWS/Azure).\nProficiency with relational databases such as MSSQL and Postgres.\nExperience with OAuth 2.0, JWT, and integrating a variety of OAuth providers.\nStrong understanding of front-end technologies, including JavaScript, HTML5, CSS3, and modern JavaScript frameworks.\nExperience working with API integrations, RESTful services, and third-party APIs.\nStrong problem-solving and debugging skills.\nAbility to work independently and as part of a team.\nStrong communication and collaboration skills.\nPreferred Skills:\nExperience with microservice and monolithic architectures.\nFamiliarity with CI/CD pipelines and DevOps practices.\nWhy Join Us:\nOpportunity to work with cutting-edge technologies in a dynamic environment.\nFlexible working hours and remote work options.\nA collaborative and innovative team culture.\nBENEFITS:\nFlexible work environment - hybrid (if near an office) or 100% remote\nWork-life balance\nMedical benefits, Retirement matching\nGenerous paid time off\nLearning Management System available through the Intranet providing free access to nearly 500 online training modules and personal development programs\nDynata offers their new colleague the opportunity to work in an open and global culture, where they welcome feedback and ideas from their colleagues. You will be working in a challenging and inspiring environment with talented colleagues from all over the world.\nWe have great opportunities for growth and professional development.\nAnd much more!\nAt Dynata, we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of our customers and communities in which we live and serve. Dynata welcomes and encourages applications from people with disabilities. We are committed to an inclusive work culture for all our employees. Accommodations by request can be made for all aspects of the selection process.\nDynata is also an affirmative action employer OE/Minority/Female/Veteran/Disabled/Sex/Sexual Orientation/Gender Identity or Expression/Race/Color/National Origin/Age/Religion/Genetic Information/Marital Status/Height/Weight or any other legally protected category defined by applicable federal state or local laws and ordinances, so as to further the principles of equal employment opportunity.\nThe base salary range for this position in is $100K-$150K/yr; however, base pay offered may vary depending on location, job-related knowledge, skills, and experience. A discretionary incentive program may be provided as part of the compensation package, in addition to a full range of medical and other benefits, dependent on full-time employment status.",
    "salary": "$100,000 - $150,000 a year - Full-time",
    "job_details": "Job details\nPay\n$100,000 - $150,000 a year\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=3a6572eefd825bd6&bb=6s3U0kDsA49dGpPMR6Y78PX50I8mmCsuEahnSX1mhtzd88FGrHMhpSSvZZieHPswzam3dEg_eqINdsuQRy98go3t9-yJUFHJiK6a56Q_IjnUWdwau-R0ZqxPXxnaQYwt&xkcb=SoAg67M30YXLcnSkMB0ObzkdCdPP&fccid=e309055190d7460e&vjs=3",
    "title": "Software Engineer",
    "description": "We are Sinch. With presence in more than 50 countries, we’re a growing global organization that helps amazing companies engage with customers on their mobile phones. And whether you know us or not, you’ve definitely used our tech. We reach every phone on earth, with over 147 billion conversations every year.\nThis is a chance for you to dream even bigger than ever. And because we believe that equal opportunities are the key to our success, no matter who you are, you’ll be able to explore career options, face fascinating challenges, building your skills alongside amazing experts. It’s not easy to reach every person, on every phone, on every channel, everywhere. Create the software that makes it happen.\n\nAs a Software Engineer in the Emergency Services Development group at Sinch, you will be part of a cross-functional team responsible for designing, developing, testing, and maintaining Sinch products. You will work on various projects, collaborating with a talented group of engineers to deliver high-quality software solutions.\n\nRequirements:\nWe are looking for motivated individuals who have:\nA bachelor’s or master’s degree in Computer Science or equivalent experience\nStrong coding skills in one or more programming languages (we use Java, Kotlin, Python and JavaScript/TypeScript)\nExperience with software development methodologies and tools (version control, issue tracking, etc.)\nExperience with some database technology like NoSQL or SQL\nA passion for building scalable and reliable software\nStrong problem-solving skills and a willingness to learn new technologies\nGood communication skills and the ability to work effectively in a team environment\nAdditional experience with these technologies will be helpful in our working environment:\nAgile frameworks like Scrum, LeSS or SAFe\nSoftware development frameworks like Spring Boot, React, NextJS, etc.\nWriting application integration or unit tests, like JUnit or Jest\nKubernetes or RedHat OpenShift, as well as containerization concepts\nExperience with telecommunications standards, software or networking concepts\nUnderstanding of 911 standards\nOur Hiring Process:\nWe are committed to ensuring a recruitment process that is fair, objective, consistent, and inclusive. Our approach includes structured, competency-based interviews designed to evaluate your skills, experience, and qualifications relevant to the role. At times, we may include a data-driven assessment to enhance our hiring success and identify candidates likely to excel.We believe in a two-way process and encourage you to ask questions throughout the journey. If this role isn't what you're looking for, please explore the other opportunities listed on our career page: https://www.sinch.com/careers/. No matter who you are, we hope you find an exciting path forward - hopefully with us!\n\nBenefits:\nSTAY HEALTHY: We offer comprehensive market competitive medical, dental, and vision plans. A variety of supplemental plans are also provided to meet your individual needs including access to telehealth for all participants.\nCARE FOR YOURSELF: Take advantage of our free virtual counseling resources through our global Employee Assistance Program. Your mental health is as important as your physical health.\nSECURE YOUR FUTURE: Plan for your future with our Roth and Pre-tax 401(k) options including an employer match for all participants.\nTAKE A BREAK: Enjoy a generous paid time off program. We value balance and understand that performance at work requires time to rest at home and/or rejuvenate on vacation.\nPUT FAMILY FIRST: We know that families can be built in a variety of ways; therefore, we offer paid parental leave and family planning support.\nWORK WHEREVER: Our flexible remote work offerings allow you to work wherever you’re the most productive and successful. It’s what you do, not where you work, that matters.\nMAKE AN IMPACT: Support betterment in your community and beyond by taking paid time off to support a volunteer program of your choice.\nThe annual starting salary for this position is $115,00.00 - $137,500. Factors which may affect starting pay within this range may include geography/market, skills, education, experience, and other qualifications. This role will be accepting applications until 3/23/25 at a minimum. Please note that the application timeline may be flexible to accommodate a comprehensive candidate evaluation.",
    "salary": "$115,000 - $137,500 a year",
    "job_details": "Job details\nPay\n$115,000 - $137,500 a year\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=ab0692908d46867b&bb=6s3U0kDsA49dGpPMR6Y78PX50I8mmCsunkg0gZUqryrwski7XNWRXdzFP8zQbp7dfpXaYjuKouMbw-PQAa4K4j-AdgdyP-Wgn0zAzOalSfSFGJDp_ymzow%3D%3D&xkcb=SoC967M30YXLcnSkMB0NbzkdCdPP&fccid=d6ef41e202aa2c0b&vjs=3"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=17a6b6662ba403be&bb=6s3U0kDsA49dGpPMR6Y78LRT6BiE668TYjUm1muDd3qaUfHGChxYOFfkLZ_F7D9-qKwofDTKaMqsxsmCZlDX9wavVjx5QuYhHzC2l0c25xO82EUax1-5xY8zPnw8Y5f8&xkcb=SoAJ67M30YXLcnSkMB0MbzkdCdPP&fccid=887b9b7f681bf424&vjs=3",
    "title": "Software Engineer",
    "description": "Who we are\nJoin Embark on our mission to bring joy to dog lovers by offering the world’s best products and services to strengthen their bonds with the dogs in their lives. Our canine DNA test — named the best by The New York Times — enables us to make scientific advances in personalized pet care.\nDesigned by world leaders in dog genetics (in partnership with Cornell University), the Embark Dog DNA Test provides information on genetic health risks and breed make-up, allowing dog owners, breeders, and veterinarians to drive personalized care plans based on a dog's unique genetic profile.\nJoin our pack! At Embark, our People First culture is centered around building an amazing team and giving everyone an opportunity to have a voice and make an impact. We are looking for highly motivated and mission-driven employees who will join us as Embark leads the cutting edge of creativity and innovation in the fast-growing consumer genetics space.\nAbout the role:\nOn the web engineering team, you will craft delightful digital experiences with Product Management and Product Design partners that span a full vertical slice, from UI to backend. Each Agile team consists of 4-5 engineers, a Product Manager, and a UX/UI designer. This year is a very exciting time to join Embark; this year the team will:\nBring to life new and exciting business developments that make Embark the premiere destination for pet parents\nElevate the delight and actionability of the platform for our highly rated DNA test products\nDevelop engaging new features and systems that transform the way pet parents understand and care for their pets\nEvolve Embark’s architecture to enable Embark to continue to scale\nOur Stack:\nReact, MUI, HTML5, CSS3\nTypeScript, Python\nNodeJS, GraphQL, Express, PostgreSQL, Redis\nAWS (ECS, RDS, ElastiCache Lambda, etc.)\nOur Tech Philosophy:\nWe continually ship value to our customers and embrace CI and CD wherever possible. We deploy our stacks using CDK and GitHub Actions.\nWe strive for a best-in-show customer experience. Observability is important to us. We leverage DataDog and Sentry and are active in detecting and resolving errors.\nWe experiment with cutting edge tech to find new and innovative ways to enrich our products and services and the way we work. Recently we have been trying llama-index, AWS Bedrock, and AWS Q Business. We use critique jam sessions to collaboratively make new technology choices.\nWhat you’ll do:\nYou are an Individual Contributor who is capable of consistently, reliably, and independently delivering well-defined solutions. You’ll utilize your strong understanding of software development and collaboration skills to maximize the impact of the code you and your teammates write. Here’s a closer look at the day to day:\nDeliver clean, efficient, maintainable code, as well as thorough tests and documentation\nPerform code reviews for others and respond to code reviews on your code\nCollaborate with our Product and Design team and stakeholders to deliver high impact products and service\nContribute to improve our technology and development practices via retrospectives and other means, with the goal of continuous improvement of quality and team efficiency\nEmbrace a continuous learning mindset – hone and develop your craft while learning cutting edge technologies in areas such as AI\nExperience we’re looking for:\n2+ years of professional web development experience\nStrong experience in an area of web development (e.g. CSS, frontend frameworks, SQL databases, APIs, etc.)\nA foundational understanding of relational databases (PostgreSQL) using SQL\nA solid understanding of AWS or similar cloud technologies\nExperience utilizing CI/CD tools like GitHub Actions or similar\nComfortable working with frontend frameworks like React, Angular, or Vue\nWillingness to participate in on-call rotation\nExcellent verbal and written communication skills\nEagerness to learn new technologies and solve problems\nNice to have:\nExperience with customer-centric product development\nUnderstanding of DevOps and Agile development philosophies\nWhy join the pack!\nAt Embark, we might be dog lovers, but we’re passionate about people too. We’re committed to building an inclusive culture where all employees can belong and flourish. Here are some of our benefits and perks:\nA flexible vacation policy so you can take off the time you need when you need it\nPaid maternal and paternal leave (plus paw-ternity leave for new pets)\nEvery other Friday off each summer\nPerks tailored for dog lovers including subsidized pet insurance\nStartup perks with big-company benefits (401k match, a generous bonus structure, commuter benefits, top-of-the-line healthcare, HSA/FSA)\nCompetitive salaries and equity participation — every employee gets stock options\nNew MacBook Pros or laptops\nContinuing education, including attending conferences and company-provided resources to help with individual growth and development\nSalary: $116k - $170k\nEmbark is an equal opportunity workplace and values diversity at our company. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, citizenship status, sexual orientation, age, disability status, marital status, gender identity or expression, veteran status, or any other characteristics protected by federal, state or local laws. See also EEO is the Law.\n\n4GvDcIpjTk",
    "salary": "$116,000 - $170,000 a year - Full-time",
    "job_details": "Job details\nPay\n$116,000 - $170,000 a year\nJob type\nFull-time\nShift and schedule\nOn call\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=4eb321028051a9f1&bb=6s3U0kDsA49dGpPMR6Y78LRT6BiE668ToCzILif3WbmEcuTq4It9cmkLqb_dacdgidrQqE4fek4cm1H3whRzYg0onpgflduBF-bNK__l-MWvpgch3KxgCa4BXPs36fAM&xkcb=SoDg67M30YXLcnSkMB0DbzkdCdPP&fccid=8d4f5beefe456ffd&vjs=3",
    "title": "Windows Software Developer II - (REMOTE)",
    "description": "Company Description\n\nINFICON is a leading provider of innovative instrumentation, critical sensor technologies, and Smart Manufacturing/Industry 4.0 software solutions that enhance productivity and quality of tools, processes, and complete factories. These analysis, measurement and control products are essential for gas leak detection in air conditioning/refrigeration and automotive manufacturing. They are vital to equipment manufacturers and end-users in the complex fabrication of semiconductors and thin film coatings for optics, flat panel displays, solar cells and industrial vacuum coating applications. Other users of our vacuum-based processes include the life sciences, research, aerospace, packaging, heat treatment, laser cutting and many other industrial processes. We also leverage our expertise in vacuum technology to provide unique, toxic chemical analysis products for emergency response, security, and environmental health and safety.\n\nJob Description\n\nThe Windows Software Developer II will join the Intelligent Manufacturing Systems (IMS) division of INFICON making industry-leading scheduling and visualization software to optimize semiconductor manufacturing. We have a talented team of Software Developers and are looking for more developers to join us! Reporting to our Director of Product Development, this is a Remote/Home Office opportunity with a flexible work schedule that will work collaboratively with our U.S. and International developers.\nResponsibilities:\nDesign, develop, implement, and maintain world-class database-driven Windows desktop applications.\nCollaborate on Microsoft Teams and video calls with other members of the consulting and programming teams.\nDetermine appropriate technical solutions and make relevant recommendations to team and clients.\nEngage in outside-the-box thinking to provide high value to clients.\nBe actively involved in projects and motivated with innovative ideas.\n\nQualifications\n\nRequired Skills and Experience:\nBachelor of Science in Computer Science or significant relevant work experience\n5+ years of Windows desktop programming experience required\nUsing Microsoft Foundation Classes\nComfortable with application authoring tools such as Visual Studio\nStrong knowledge of multithreaded and thread-safe design\nGood working knowledge of databases and SQL\nEffective communication, comfortable discussing solutions with team and customers\nExperience with industrial applications such as manufacturing applications\nAbility to juggle multiple priorities and projects at the same time\nMust write neat and organized code and maintain documentation\nAgile Software Development methodology\nExperience with GIT or other content versioning system\nStrong troubleshooting skills in Windows environment and applications\nStrong desire to learn and improve\nExperience with network programming\nPreferred Skills:\nSemiconductor Manufacturing\nFault Detection and Classification (FDC)\nProject Management\nData Analysis\nPython or similar scripting\nHardware communication programming\nAngular, JavaScript/TypeScript, or C# programming\nUI design using Microsoft Foundation Classes\n\nAdditional Information\n\nFor New York, the expected salary range for this position is between $90,000 and $150,000 per year. In addition, INFICON employees are eligible for a profit sharing bonus with a target of 10%. The actual compensation will be determined based on experience, location, and other factors permitted by law\nINFICON provides a dynamic work environment that promotes diversity, equity, and inclusion. Our employees experience ongoing green initiatives, flexible work hours, and a variety of health and wellness programs.\nINFICON’s forward-thinking approach offers countless opportunities to design, support, and manufacture a diverse product portfolio that expands globally. Our Lean and Agile work environment offers competitive compensation, relocation assistance, a discretionary bonus, and generous employee benefits; major medical, dental, health, vision, 401K, vacation and sick time, tuition reimbursement, and more!\nINFICON is committed to ensuring that our online application process provides an equal opportunity to all job seekers that apply without regard to race, religion, ethnicity, national origin, citizenship, gender, age, protected veteran status, disability status, genetic information, sexual orientation, or any other protected characteristic. A notice describing Federal equal employment opportunity laws is available here and here to reaffirm this commitment.\nINFICON, Inc. strictly complies with all aspects of the Export Administration Regulations ('EAR'), including those sections dealing with deemed exports to foreign nationals.",
    "salary": "$90,000 - $150,000 a year - Full-time",
    "job_details": "Job details\nPay\n$90,000 - $150,000 a year\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=4675b6feb46e1b5f&bb=6s3U0kDsA49dGpPMR6Y78N8xUjKZOIs0zfdVxsiF3vq5AS1ARt7JvP9pforVfLlSO6pBrt87HUzyT1i0_6oSThto4iJDxMGcSnU071dWK87NITZ2qfeRCigeOtn8ZH9z&xkcb=SoBU67M30YXLcnSkMB0CbzkdCdPP&fccid=166c6a42cdb9d826&vjs=3",
    "title": "Senior Frontend Engineer",
    "description": "Skylight is a technology startup based out of Los Angeles and San Francisco. Our mission is to connect loved ones by creating the world’s simplest products and services that improve family life. We make consumer products, like Skylight Frame and Skylight Calendar, that are loved by millions of people across the globe. Our founders are former venture capitalists and serial entrepreneurs, who have scaled this business to $180M+ in annual revenue while being completely bootstrapped and profitable. We think often about the thousands of smiles we are able to put on our customers’ faces each day, and it fills our hearts with purpose. That’s why we have been working hard to expand our team and invent, so that we can continue to bring the magic of Skylight to millions of loved ones throughout the world.\nAt Skylight, our engineering team is small but mighty — our software powers an experience for millions of customers. We've built a healthy, bootstrapped, and profitable business, and are scaling our Engineering team to better support our growth, improve our technical infrastructure, and continue to expand the feature set for customers.\nSkylight is seeking a Senior Frontend Engineer to support our Ecommerce team. You'll be instrumental in driving our ecommerce initiatives forward. You'll leverage your expertise to create seamless, high-converting user experiences across our digital touchpoints.\nResponsibilities\nDevelop and optimize high-performance, responsive web applications using React and Shopify's liquid templating language\nImplement and refine our ecommerce strategy, focusing on improving conversion rates for both sales and Plus subscriptions\nCollaborate on pricing strategies and implement A/B testing for merchandising\nStreamline subscription management and operations\nAutomate marketing workflows to reduce engineering bottlenecks\nWork closely with cross-functional teams, including Design, QA, and backend developers\nRequirements\n5+ years frontend development with a proven track record of continuous improvement: Driving best practices in frontend development, focusing on code quality, scalability, and performance optimization\nExpert knowledge of modern JavaScript, HTML5, and CSS\nStrong experience with modern JavaScript Frameworks, React preferred\nStrong knowledge of responsive design and cross-browser compatibility\nProven track record of optimizing web performance and implementing best practices for SEO\nExcellent problem-solving skills and attention to detail\nStrong communication skills and ability to work in a collaborative team environment\nPreferred Qualification: Experience with frameworks like NextJS, Remix, Astro, or Gatsby\nPreferred Qualification: Experience with greenfield development, including the ability to make architectural decisions from the ground up, designing scalable and maintainable solutions\nPreferred Qualification: Experience with Shopify theme development and customization\nPreferred Qualification: Experience with ecommerce analytics and conversion rate optimization\nBenefits\nOur competitive compensation package includes:\nCompetitive Salary ($160k-190k DOE) + Equity Package\n401K matching\nWellness, learning, and home-office budgets\nHealth, Dental & Vision Medical Plans\nTremendous autonomy to set the direction of your work\nUnlimited PTO\nCompany holidays on the first Friday of every month (Except November & December)\nEqual opportunity employer\nSkylight is committed to building a diverse and inclusive team. All qualified applicants will be considered without regard to race, color, religion, sex, sexual orientation, gender identity or expression, age, national origin, disability, protected veteran status, or any other factor protected by applicable federal, state, or local laws. If you’re the best person for the job, we want you on board!\nFor Colorado-based candidates, the range being offered for this role is $160K-190K based on experience and for California-based candidates, the range being offered for this role is $160K-190K based on experience. Pursuant to the San Francisco Fair Chance Ordinance, we will consider employment for qualified applicants with criminal histories in a manner consistent with the requirements of this law.\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.",
    "salary": "$160,000 - $190,000 a year - Full-time",
    "job_details": "Job details\nPay\n$160,000 - $190,000 a year\nJob type\nFull-time\nShift and schedule\nHolidays\nWork setting\nRemote\nEncouraged to apply\nFair chance\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=9eb657af623aaf00&bb=6s3U0kDsA49dGpPMR6Y78LYM0f8TTJ1nCUWhY848eAHsk-sDBNaJ0VxOIavQYYAy2KF9vJg_9UyVwrive7sfM9rVAltyQyw6aG6CKVLCFjrFFXYyq_E_7psmHhUNS2qY&xkcb=SoDJ67M30YXLcnSkMB0BbzkdCdPP&fccid=08bfce1064449178&vjs=3",
    "title": "Frontend Software Engineer, Web Marketing Platform",
    "description": "It all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay/Clearpay, to provide a better way to send, spend, invest, borrow and save to our 50+ million monthly active customers. We want to redefine the world's relationship with money to make it more relatable, instantly available, and universally accessible.\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We've been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\nThe Role\nThe Web Marketing Platform team is focused on building tools to unlock creativity, and amplifying the expression and style that make Cash App unique. As a team, we span a broad spectrum of web development – from foundational frontend architecture and analytics pipelines, to the building blocks that power our services and content management systems. We are responsible for the homepage, product pages, and various online experiences.\nAs a software engineer, you will work with internal teams and external partners to regularly ship new marketing experiences while exploring business and growth opportunities.\nWork from anywhere: This role can be performed from any location in the USA\nYou Will\nDesign, build and support the web development of our marketing experiences\nBuild highly accessible and beautiful web experiences that delight our users\nWork cross-functionally and communicate with our product, design, and other engineering teams to support new services and experiences\nFocus on all aspects of product quality, including in-depth metrics and monitoring\nYou Have\n2+ years of software development or equivalent experience with expertise in web development\nProficiency creating readable, well-crafted, and maintainable code\nDepth and breadth of experience crafting JavaScript applications\nExperience working with other engineering teams and cross functional partners; product managers, business analysts, designers, and marketing teams.\nA commitment to continuous improvement and learning from others along the way\nA vested interest in advancing Cash App's vision of building for economic empowerment\nTechnologies We Use and Teach\nFrontend: React, CSS, Preact, Javascript, Typescript, NextJS\nCommunication: HTTP, JSON, and Protocol Buffers\nServer: Node, Java\nWe're working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is an equal opportunity employer evaluating all employees and job applicants without regard to identity or any legally protected class. We will consider qualified applicants with arrest or conviction records for employment in accordance with state and local laws and \"fair chance\" ordinances.\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible.\nWhile there is no specific deadline to apply for this role, U.S. roles are typically open for an average of 55 days before being filled by a successful candidate. Please refer to the date listed at the top of this job page for when this role was first posted.\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.\n\nZone A:\n$142,000—$213,000 USD\nZone B:\n$134,900—$202,300 USD\nZone C:\n$127,800—$191,600 USD\nZone D:\n$120,700—$181,100 USD\nEvery benefit we offer is designed with one goal: empowering you to do the best work of your career while building the life you want. Remote work, medical insurance, flexible time off, retirement savings plans, and modern family planning are just some of our offering.\nBlock, Inc. (NYSE: XYZ) builds technology to increase access to the global economy. Each of our brands unlocks different aspects of the economy for more people. Square makes commerce and financial services accessible to sellers. Cash App is the easy way to spend, send, and store money. Afterpay is transforming the way customers manage their spending over time. TIDAL is a music platform that empowers artists to thrive as entrepreneurs. Bitkey is a simple self-custody wallet built for bitcoin. Proto is a suite of bitcoin mining products and services. Together, we’re helping build a financial system that is open to everyone.",
    "salary": "$120,700 - $213,000 a year",
    "job_details": "Job details\nPay\n$120,700 - $213,000 a year\nWork setting\nRemote\nEncouraged to apply\nFair chance\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=7aea903c78168fde&bb=6s3U0kDsA49dGpPMR6Y78LkaorpzO6hiFkRLySb3wRgkBAfPWbMhO_sco9SS3xjN77gB32YNgTT3BnSu_QSjz__cSKqf4AftQpL5pqFavDEfi5JdjXZlpfkYwrT79XKc6kvUaWgwRY0%3D&xkcb=SoB967M30YXLcnSkMB0AbzkdCdPP&fccid=70dbb8682c90aea7&cmp=BELVA&ti=Developer&vjs=3",
    "title": "React Developer",
    "description": "Role and Responsibilities:\nOur React Developers will be asked to help with building performant web apps on all major browsers. They will be responsible for architecting and building these applications, as well as coordinating with the teams responsible for other layers of the product infrastructure.\nAs the React Developer, you will have the chance to:\nDevelop web apps on all major browsers using React.\nWork on projects that impact entire industries with our bleeding edge technology solutions.\nPlay a pivotal role in shaping the organization's web app offerings and influencing its technological direction.\nCollaborate with cross-functional teams to ensure seamless integration and exceptional user experiences.\nContribute to the growth and mentorship of junior developers and potentially lead project teams.\nDrive innovation and excellence in web app development through your expertise.\nMaintain code and write automated tests to ensure the product is of the highest quality.\nParticipate in Agile routines and ceremonies; daily standups, sprint planning, sprint demos / retrospectives.\nWork with other teams (i.e., Product, PM, etc.) to ensure delivered code meets specifications based on functional/technical specifications.\nCreate unit and integration tests to fully test and regress software. Break down complex requirements into independent coding tasks and strategies.\nQualifications and Experience:\nMust be a Citizen or Green Card Holder and live in the United States\nB.S in Computer Science or equivalent experience\n3+ years of overall front end development experience.\nA minimum of 2+ years of development using React for enterprise level web applications.\nA minimum of 2+ years of architecting complex front end enterprise level solutions.\nProven track record of successfully launching and maintaining web applications.\nStrong proficiency in JavaScript, TypeScript, and related technologies.\nExcellent problem-solving skills and the ability to tackle complex challenges.\nStrong verbal and written communication skills.\nOpenness to new ideas and an unceasing desire to learn new things.\nDesired Experience:\nExperience with TDD or BDD\nExperience working with cloud-native, scalable, and highly available distributed systems.\nExperience with Atlassian tools: JIRA, Confluence, etc.\nWhy Join Us:\nIndustry Leadership: Become a key player in a pioneering A.I. Telecommunications company that is an upcoming industry leader.\nMeaningful Impact: Contribute to the creation of accessible and flexible A.I. Telecommunications solutions that empower customers and businesses.\nProfessional Growth: Embrace challenging projects that expand your skill set, foster continuous learning, and elevate your career trajectory.\nWe eagerly anticipate the chance to discuss how your expertise can contribute to our team's success and make a lasting difference. Your consideration is highly valued, and we look forward to the possibility of working together.\nJob Type:\n● Full-time\nExperience level:\n● 3-6yrs\nSchedule:\n● 8 hour shift\n● Monday to Friday\nJob Type: Full-time\nExperience:\nFront-end development: 3 years (Required)\nReact: 2 years (Required)\nJavaScript: 3 years (Required)\nTypeScript: 3 years (Required)\nJira: 2 years (Preferred)\nBDD: 2 years (Required)\nWork Location: Remote",
    "salary": "Full-time",
    "job_details": "Job details\nJob type\nFull-time\nShift and schedule\n8 hour shift\nMonday to Friday\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=debb794e317f6bc9&bb=6s3U0kDsA49dGpPMR6Y78Fa9qYfnJJjukKmoMhHsd0Ths5zk9tTGkdF2TxqoH7hHUUU_D8Q5x7ITmchKilqMQoRBMIi712wxOgNIY7Jpp_RnO6rIhiwVZVuaNq0IZHFc&xkcb=SoDz67M30YXLcnSkMB0HbzkdCdPP&fccid=5abbd6e84bf247cc&vjs=3",
    "title": "Software Engineer, Product (Los Angeles Remote)",
    "description": "Build and enhance the product that powers better access to banking\n\nThe Prelim team is seeking a Software Engineer, Product to join our (small, but growing!) team. As a member of our team, you will have the opportunity to help increase access to banking for millions of people. If you're passionate about engineering and eager to be part of a fast-paced remote startup culture, we encourage you to apply to join our team today!\n\nAs a Software Engineer, Product at Prelim, you will be responsible for designing, building, and optimizing the platform that powers digital account opening for banks across the world. You will work closely with Prelim's customers, designers, and product stakeholders to develop innovative solutions that enhance user experiences and meet the complex needs of banks and their customers.\nKey Responsibilities:\nWork across the entire stack, from React to Node.Js to PostgreSQL.\nPlan, shape and build new features and enhancements.\nUnderstand banks and their customers, and every financial service from deposit accounts to loans to treasury services.\nDeliver a platform that is accessible, reliable, scalable and optimized for banks and their customers across the world.\nQualifications:\nThoughtful problem-solving: For you, problem-solving starts with a clear and accurate understanding of the context. You can decompose tricky problems and work towards a clean solution, by yourself or with teammates. You're comfortable asking for help when you get stuck.\nPragmatism and impact-orientation: You care about business impact and prioritize projects accordingly. You're not just going after cool stuff—you understand the balance between craft, speed, and the bottom line.\nPutting users first: You think critically about the implications of what you're building, and how it shapes real people's lives. You understand that reach comes with responsibility for our impact—good and bad.\nEmpathetic communication: You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time. In disagreements, you engage thoughtfully with other perspectives and compromise when needed.\nTeam player: For you, work isn't a solo endeavor. You enjoy collaborating cross-functionally to accomplish shared goals, and you care about learning, growing, and helping others to do the same.\n$100,000 - $120,000 a year\nAbout Prelim:\n\nPrelim is a cutting-edge software provider that specializes in customer onboarding for banks. Our platform is designed to streamline the account opening process for both consumers and businesses, increasing speed-to-market and improving the customer experience.\n\nWe pride ourselves on being a forward-thinking and innovative company, always on the lookout for new ways to improve our offerings and stay ahead of the curve in the banking industry. Our small team is made up of passionate and dedicated individuals who are committed to delivering exceptional results for our clients.\n\nAs a member of the Prelim team, you will have the opportunity to work with cutting-edge technology and be at the forefront of the digital account opening industry. You will have the chance to work with a diverse range of clients, including some of the biggest names in the banking industry, and have an outsized impact.\n\nWe offer a fast-paced and dynamic work environment, with ample opportunities for growth and advancement. If you're excited to be part of a team that is shaping the future of the banking industry, then we encourage you to apply to join us at Prelim. We are looking for individuals who are driven, ambitious, and excited about the opportunity to make a real impact in the digital account opening industry.\n\n#LI-Remote",
    "salary": "$100,000 - $120,000 a year - Full-time",
    "job_details": "Job details\nPay\n$100,000 - $120,000 a year\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=88bb00fa0875a89e&bb=6s3U0kDsA49dGpPMR6Y78M_71keL27sfwXz7sWKi4B-xs1N-nyhon4LvMwfRYKJFtzp9HuIwCl3h_ixa8M0vv7cM4NVAMBBYe8B-EDcLOgVfVO__p3TZDvOcSBoso-Yg&xkcb=SoBH67M30YXLcnSkMB0GbzkdCdPP&fccid=874534bc2e966a3e&vjs=3",
    "title": "Frontend Software Engineer III",
    "description": "About Sunbound\nCompany. Sunbound is building the “financial OS for senior care”. The current senior care payments experience is broken which increases costs and inefficiencies for senior living operators while making it confusing, cumbersome and stressful for families. Sunbound was created to solve this problem by building the first modern platform to handle this process end-to-end and save operators and families time, money and effort.\nMission. Our founders were inspired to start the business after seeing the pain points firsthand with their own families, and deeply care about helping one of the most overlooked groups in our population: seniors. Sunbound’s mission is to make managing money for senior living easy, so our customers can focus on what really matters: providing quality housing & care.\nTeam. We're a dedicated, close-knit group focused on expanding hubs in Downtown Brooklyn, NYC, and Washington, DC.\nTraction. Since launching in mid-2023, we now serve thousands of families. We’re currently doing 7 figures in ARR.\nGrowth. Sunbound has absolutely caught fire as a business, growing 30% month-over-month. The senior living market is massive at >$230b and is expected to grow rapidly as the “baby boomer” generation continues to age.\nFunding. We've raised now three rounds of funding from top-tier investors including Fika Ventures, Bling Capital, Liquid2 Ventures, LiveOak Bank, Cambrian Ventures and Max Ventures. These firms have collectively backed over 20 unicorns such as Square, Lyft and Rippling.\nAbout the Role\nWe're looking for a frontend software engineer to join our team and help us grow our product. This is an early engineering role and will carry a lot of opportunities to work closely with the CTO and shape company direction and culture.\nResponsibilities\nAssist in building our design system\nCollaborate cross-functionality on product ideation and direction\nDefine solutions to new problems and own the related projects\nPropose, demonstrate, and implement improvements to our tooling stack\nHelp build an amazing, world-class product\nSkills and Qualifications\nBA or BS (or Master’s) in Computer Science or related technical discipline\n4-7 years of experience in software development\nExperience at fintech companies a major plus\nExperience building software solutions incorporating disparate aspects of complex business processes\nProficiency in frontend web development\nProficiency with React\nProficiency with Redux\nProficiency with Typescript\nProficiency with Figma\nClear communication verbally and in writing with non-technical stakeholders\nWhy join us:\nLow-ego, tight-knit, collaborative, high-performing team\nMission-driven.\n‍We’re here to help people manage payments for something critical — care for their loved ones and to take work off of the plates of the folks providing care. We believe what we do really matters and take care and pride in doing it well.\nCustomer-focused.\nOur whole team is here because we care! We’re laser-focused on providing an excellent customer experience in every role, at every level of the organization.\nOpportunities for growth.\n‍You’ll have the opportunity to help shape the team as it grows, explore your own interests, and grow with the company.\nEqual opportunity employment\nWe are an equal opportunity employer. We search for amazing people of diverse backgrounds, experiences, abilities, and perspectives. We take care of each other to create an inclusive work environment where we love to come to work every day. We'd be happy to provide reasonable accommodations to help you apply – just email us at apply@sunboundhomes.com. We hope you can join us.\nCompensation Range: $130K - $160K",
    "salary": "$130,000 - $160,000 a year - Full-time",
    "job_details": "Job details\nPay\n$130,000 - $160,000 a year\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=c5a7e3f760d87780&bb=6s3U0kDsA49dGpPMR6Y78LkaorpzO6hiKBOTDHtymCJTQDzZGsWme3o0mwIZn4RfwjMmQ9bgq2TYO1QbbvufkuqBL6cM3PRLtyZ8og1TZg0Iov7K1sVI5SDrRTGWZn3b&xkcb=SoDa67M30YXLcnSkMB0FbzkdCdPP&fccid=c48154274cb2c52a&vjs=3",
    "title": "Software Developer",
    "description": "Software Developer\nRemote | United States\nRole Overview\nWe are seeking a highly skilled Software Developer to join Property Leads, a fast-growing start-up specializing in lead generation and data solutions for the real estate industry. This role is crucial in automating processes and ensuring our company remains lean and efficient.\nWith a small, dynamic team of 16 people, this position requires more than a traditional 9-to-5 commitment. The ideal candidate will have a strong problem-solving mindset, be a self-starter, and thrive working both independently and collaboratively.\nResponsibilities\nAutomate processes and develop solutions to improve efficiency and scalability.\nBuild and maintain APIs to integrate our lead distribution system, CRM, phone system, and databases.\nWork closely with two experienced developers and the leadership team (who have software engineering backgrounds) to drive revenue and reduce costs.\nDevelop and maintain software using Python (90%), JavaScript (Node.js) (9%), and HTML/CSS (1%).\nLeverage machine learning (ML) and artificial intelligence (AI) to improve lead scoring, predictive analytics, and automation.\nDesign and implement solutions using ML models to enhance data accuracy and customer insights.\nStay on top of tech trends, particularly in serverless environments and AI/ML advancements.\nRotate on-call during weeknights and weekends to resolve any software crashes or errors.\nDocument software architecture and processes for team-wide understanding and scalability.\nQualifications\nBachelor's degree in Computer Science, Software/Computer Engineering, or a related field preferred (or equivalent experience).\n5+ years of experience in software development.\nProven experience with machine learning and AI frameworks (e.g., TensorFlow, PyTorch, Scikit-learn).\nExperience developing software in a serverless environment (AWS preferred).\nStrong proficiency with Python for data processing and ML development.\nExperience using MongoDB or similar database structures.\nProficient in building and utilizing APIs.\nBasic understanding of JavaScript (Node.js) for developing efficient, reusable code.\nHighly motivated and detail-oriented with a track record of delivering software in a fast-paced environment.\nStrong interpersonal and communication skills.\nBenefits\nUnlimited PTO\nPaid Sick Time\nCompetitive compensation with growth opportunities in a fast-scaling start-up environment",
    "salary": "$100,000 - $175,000 a year - Full-time",
    "job_details": "Job details\nPay\n$100,000 - $175,000 a year\nJob type\nFull-time\nShift and schedule\nOn call\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=4f38d7b4be5faf1a&bb=joHeW4OfLPX-tP8tPFKrRH8pGA45HfVoXDEHcHi8qkaMzKLDPiLa4gpI3oZt03Fyq81dcRbHcG6LOO9TUI9T0jE2M58vAKvuhGRvZuXkdG4BoHlUCfnNodSFT06hv3_0&xkcb=SoCU67M30YXCMHQh8Z0LbzkdCdPP&fccid=eb3f462295a47628&vjs=3",
    "title": "Senior Software Engineer - React.js",
    "description": "About Us\n\nIndex Engines is a recognized leader in enterprise information management and archiving solutions. As data volumes continue to grow exponentially, organizations face increasing challenges in managing, securing, and accessing their data efficiently. Our innovative, AI-driven platform empowers businesses with the ability to index, classify, and manage enterprise data seamlessly, enabling cost-effective storage, robust security, and risk mitigation.\nOur proprietary technology integrates advanced machine learning capabilities to identify key data components, including named entities such as names, addresses, locations, organizations, emails, and phone numbers, while also detecting potential cybersecurity threats. Through our CyberSense technology, we provide industry-leading ransomware detection, leveraging AI models to analyze data integrity and identify threats by evaluating over 100 distinct data features. This ensures organizations can quickly detect, respond to, and recover from cyber threats.\nSince 2004, Index Engines has been a trusted partner for enterprises seeking scalable, high-performance information management solutions. Our mission is to provide cutting-edge tools that enhance data governance, compliance, and security, helping businesses unlock the full potential of their data assets.\n\n\nThe Role\nWe are seeking a Senior UI Software Engineer - React.js to join our Web Applications Team. This individual will play a critical role in designing, developing, and maintaining high-performance web-based applications using modern front-end technologies. As a key contributor to our Agile Scrum team, you will work closely with product managers, UX designers, and backend engineers to deliver intuitive, scalable, and high-quality software solutions that enhance our platform’s capabilities and user experience.\nKey Responsibilities:\nDesign, develop, and maintain responsive, scalable web applications using React.js and related front-end technologies.\nCollaborate with product management and UX/UI designers to translate business requirements into functional and engaging user interfaces.\nParticipate in architectural discussions and contribute to software design decisions to ensure performance, security, and scalability.\nDevelop and integrate front-end applications with RESTful APIs, ensuring seamless and efficient data exchange.\nImplement unit testing and support QA processes to maintain code quality and reliability.\nEngage in Agile Scrum ceremonies, including daily standups, sprint planning, retrospectives, and demos.\nStay informed on emerging technologies, best practices, and front-end development trends to drive continuous improvement.\nContribute to cloud-based application development efforts using AWS, Azure, or Google Cloud.\n\n\nJob Requirements\nWe are looking for a proactive and solutions-oriented engineer who thrives in a collaborative, fast-paced environment. The ideal candidate is passionate about front-end development, takes ownership of their work, and continuously strives for technical excellence.\nRequired Qualifications:\nBachelor’s degree in Computer Science, Software Engineering, or a related field.\n7-10 years of experience in software engineering with a strong focus on front-end development.\nProficiency in React.js, TypeScript, JavaScript (ES6+), HTML, CSS, and UI/UX design principles.\nExperience working with Material Design or similar UI frameworks.\nStrong understanding of RESTful APIs and best practices for integrating them into front-end applications.\nFamiliarity with Node.js and npm for package management and development workflows.\nExperience working in a Linux development environment.\nStrong problem-solving skills, attention to detail, and ability to work effectively in a cross-functional Agile team.\nExperience with GitHub and Atlassian Jira for version control and project management.\n\n\nPreferred Qualifications:\nExperience with TypeScript for building scalable and maintainable applications.\nFamiliarity with state management libraries such as Redux, Zustand, or Context API.\nKnowledge of testing frameworks like Jest, React Testing Library, or Playwright for unit and integration testing.\nExposure to cloud platforms (AWS, Azure, or Google Cloud) and CI/CD pipelines for automated deployments.\n\n\nLocation:\nIndex Engines is considering candidates for the following location:\nColorado Springs, CO\nIf you are passionate about front-end development, thrive in a dynamic and innovative environment, and want to work on cutting-edge enterprise software solutions, we encourage you to apply and become a valuable member of the Index Engines team!",
    "salary": "Full-time",
    "job_details": "Job details\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=6c34996613e3b6ed&bb=joHeW4OfLPX-tP8tPFKrRCSw-oClyPUw_SmTohb6_TAsnkK_suFRA8QDX6YTEMpGzwOcNnlAbAxPi_QlXYxRBLO0_lgyfdqDXGiI79mliPIlaCOID-qUD_j7Ul8QMQye&xkcb=SoAg67M30YXCMHQh8Z0KbzkdCdPP&fccid=dd616958bd9ddc12&vjs=3",
    "title": "Senior Software Developer - C# Focus",
    "description": "Description:\nAEM (Advanced Environmental Monitoring) is the global leader in innovative mission critical weather, wildfire and water monitoring and intelligence solutions. We aim to be the world’s essential source for environmental insights – enabling decisive action and positive outcomes for our customers and their constituents. Our family of innovators offers world-class hydrometeorological technologies and services, including sensors, dataloggers, telemetry, and advanced analytics and software. Our technology and services empower the communities and organizations to survive – and thrive – in the face of escalating environmental risks.\nOur software development teams maintain the creative spirit of a startup, while enjoying the benefits of a somewhat larger organization. We are comprised of fast paced, cross-functional, Agile scrum teams that love to collaborate, encourage curiosity, and continuously ship improvements that create better solutions for our customers worldwide.\nAEM is seeking experienced software developers who are passionate about helping to improve the planet and who are excited to support their colleagues in their growth as they develop and progress towards achieving their professional goals. As we gather environmental information in real-time from our worldwide networks of sensors, we will be turning this data into actionable intelligence that meteorologists use to make predictions and to help people stay safe based on environmental insights. If you’re someone who has developed applications using C# with .NET & JavaScript and also knows how to take on and overcome complex scaling issues while also being comfortable working with other technology frameworks such as React – come join our team!\nJob Responsibilities:\nProvide technical leadership for teams building new features and enhancing our existing software, tools and experiences\nHelp delight our customers by extending our application capabilities\nArchitect and lead efforts to design and build new APIs, web services, and microservices while supporting the worldwide operations of AEM’s cloud-based & on-premise environmental monitoring & meteorological solutions\nDesign, develop, and operate various portions of our applications with lots of autonomy while working on challenging applications related to climate and meteorology\nWork with our full software stack along with our team of iOS, Android, and Front End, Back End Engineers, and academic researchers who, along with you, are responsible for evaluating new tools and technologies, building prototypes, and extending the capabilities of AEM’s sensor networks\nCollaboratively experiment, prototype, take risks and document your work while helping to build new applications, web services, and tools used by AEM’s product offerings\nRequirements:\nBachelor’s degree in Computer Science, Mathematics, or a related technical discipline, or equivalent relevant industry experience.\n10+ years’ experience writing performant code in more than one compiled programming language (i.e. C++, C#, Java, or similar) using one or more frameworks such as Microsoft .NET and Java Spring. You also use one or more scripting languages such as PHP or Python for other tasks.\n5+ years of experience developing and deploying web services on cloud-based infrastructure (e.g. AWS, Azure) on a large scale supporting at least 2,000 simultaneous users\nOutstanding technical problem-solving, design, and coding skills\nPassionate about building well-constructed software where security is built-in by design and have collaboratively designed complex software architectures as part of matrixed team\nUnderstand the need for abstraction and separation of concerns while being thoughtful about where & when to apply it\nYou are the paradigm of the “Full Stack Developer”; you wield various web presentation frameworks such as Angular, Boostrap, jQuery, and React with ease and you often catch yourself thinking in JavaScript.\nYou understand what makes software testable and if needed how to refactor an application written by others to support being tested using an automated test suite of your own design. You regularly use tools such as BenchmarkDotNet, NUnit / JUnit, Selenium / TestComplete, and TestRails to ensure your code works as designed and is performant.\nKnowledgeable about networking protocols such as TCP/IP, UDP/IP, HTTPS and HTTP/2 as well as having built applications that communicate using WebSockets\nAbility to understand the intricacies of web authentication such as sessions, API tokens, OAuth / OIDC, and JWTs. You automatically build your web applications to support single sign-on using a variety of identity providers.\nAbility to communicate effectively & persuasively both in-person and in the written form. People trust you and consider you as the “go to” person to bounce new ideas around with.\nYou are adaptable, collaborative, and love eliminating ambiguity by figuring things out.\nPreferred Experience:\nExperience with developing applications for managing large networks of sensors, meteorology, or weather\nFamiliarity with GitHub Enterprise and scanning your code using static analysis tools such as SonarQube\nExperience deploying applications to either AWS or Microsoft Azure using Terraform\nCanadian Compensation Range: A reasonable estimate of the current salary range for this position is $95,000 - $120,000 CAD per year. Please note that the salary information is a general guideline only. AEM considers a wide range of factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience, education, licensure and certifications, key skills as well as other market and business considerations when extending an offer. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled.\nThis position will accept applications on an ongoing basis and will be closed once the position is filled.\n\nAEM is an Equal Opportunity Employer.",
    "salary": "$95,000 - $120,000 a year",
    "job_details": "Job details\nPay\n$95,000 - $120,000 a year\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=8bb5198bc4ce15b7&bb=joHeW4OfLPX-tP8tPFKrRDlknqG2lVA8eUk6ApR6IXqL3-G7pKNyhcefbhol1-_pJtldYhoiMoxJRsf7FN-9oqpE081FvUVsBU9M5rdNG3cx6EVTerbPPb0tlhGLqsdE&xkcb=SoC967M30YXCMHQh8Z0JbzkdCdPP&fccid=521dd2674b53950f&vjs=3",
    "title": "Software Engineer-Products",
    "description": "Job Title: Software Engineer\nLocation: Chicago IL-Remote/Hybrid\nAbout Us:\nPredictive Sales AI is at the forefront of transforming the home services industry with AI-driven software. We empower businesses to make smarter decisions, increase efficiency, and unlock new growth opportunities. As part of our growth, we are seeking an experienced accountant who thrives in a fast-paced, innovative environment.\nAre you passionate about supporting business growth through innovative products that are reshaping the industry? At Predictive Sales AI, we're revolutionizing the home services market with cutting-edge AI-driven software, and we’re looking for a talented Accountant to join our dynamic team. If you're passionate about advancing financial practices while supporting tech-focused clients, we want to hear from you!\nJob Overview:\nAs a Software Engineer, you will be responsible for the development, maintenance, and enhancement of our web applications and APIs, working on a variety of exciting projects for both internal and client-facing platforms. You’ll collaborate closely with other engineers, account managers, and clients to design and deliver solutions that meet business needs while maintaining high standards for security, performance, and user experience.\nKey Responsibilities:\nWeb Application Support: Contribute to the fulfillment and assurance of Spectrum’s web application products based on feedback from proprietary monitoring tools and those provided by managed services.\nPlatform Maintenance: Develop and maintain Spectrum APIs used by our platforms. Handle bug requests, develop new features, and write documentation for bugs and features. You'll also manage migrations between platforms (Full Service) and handle manual patches when necessary.\nCollaborative Development: Collaborate with other software engineers to build solutions catered to Spectrum's client base. Work on new product features and enhancements, ensuring that the system remains scalable and efficient.\nInternal Applications Development: Develop internal applications in a hands-on role with a focus on improving core efficiency and supporting revenue generation.\nProject Development: Engage in project work, developing fully featured projects. You'll pair with a senior software engineer when necessary to ensure best practices and high-quality output.\nClient Customization and Support: Develop and maintain customizations for clients, ensuring their specific needs are met. Coordinate closely with account managers via Basecamp to ensure client requirements are met on time.\nConsumer Insight & Client Meetings: Lead consumer insight meetings with clients and account managers to understand and meet client goals when developing new products.\nCode Maintenance & Enhancement: Maintain existing code, write, tune, and debug SQL stored procedures for use with web applications. Regularly work on enhancements and new features to improve the existing platform.\nCode Reviews: Participate in code reviews with other team members to ensure development guidelines and security standards are met. Code written is reviewed by others on the team before release to ensure high-quality output.\nContinuous Learning: Engage in continuous training to stay updated with the latest technologies and methodologies. This ensures you’re always learning and growing, both as a developer and a professional.\nDesired Traits:\n\nWe are looking for an individual who is organized, proactive, and detail-oriented. In this role, you will work closely with teams across the company. Here’s what we’re looking for:\nStrong analytical and problem-solving abilities.\nHighly organized, with a keen eye for detail and accuracy.\nExcellent oral, written, and interpersonal communication skills.\nDemonstrated ownership and follow-through on tasks.\nCustomer service-focused with a solution-oriented approach.\nProfessional demeanor and composure.\nRequired Skills and Experience:\nBachelor’s degree in computer science or a related field.\n.NET/C# Experience: 1-2 years of experience in .NET/C# development.\nMicrosoft SQL: 3-4 years of experience with Microsoft SQL.\nProficiency with Visual Studio: Expert-level use of Visual Studio.\nRESTful Web Services: Extensive experience with designing and working with REST APIs.\nFront-End Knowledge: Expert-level knowledge of HTML/CSS and basic knowledge of JavaScript and jQuery.\nVersion Control: Experience using Git, SVN, or similar version control systems.\nMVC & OOP: In-depth experience with the MVC design pattern and object-oriented programming.\nWhy Join Us?\nInnovative Environment: Be part of a forward-thinking company that values creativity and encourages the exploration of new ideas.\nProfessional Growth: Access opportunities for continuous learning and career advancement within a supportive and dynamic team.\nComprehensive Benefits: Enjoy a competitive salary, performance-based bonuses, flexible work arrangements, and a robust benefits package.\nCollaborative Culture: Work in a team-oriented environment where collaboration and mutual respect drive our success.\nIf you're ready to be part of an innovative, growth-oriented team, apply today!\nINDPSAI",
    "salary": "Full-time",
    "job_details": "Job details\nJob type\nFull-time\nWork setting\nHybrid work\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=63c42d8c7d480603&bb=joHeW4OfLPX-tP8tPFKrRDnl1JI7JfLhpMJfllyVq38RFiNqE6RP84uGaO_LKi6C0DpXGR7HhsYJG7XXNYvQCBLBrT0PdbPPrBcsm_rv-49cBZCEjnqtLlSx5rj4MwQx&xkcb=SoAJ67M30YXCMHQh8Z0IbzkdCdPP&fccid=09a72504958ef098&cmp=Diagonal-Matrix-Ltd&ti=Full+Stack+Developer&vjs=3",
    "title": "Full Stack Developer",
    "description": "Job Title: Full-Stack Developer\nLocation: Remote\nJob Summary:\nWe are seeking an experienced Full-Stack Developer to join our dynamic software development team. The ideal candidate will have a strong background in both front-end and back-end technologies and will be responsible for developing and maintaining web applications. You will work closely with other developers, designers, and product managers to deliver scalable, user-friendly solutions.\nKey Responsibilities:\nDesign, develop, and maintain both front-end and back-end systems for web applications.\nCollaborate with cross-functional teams to define and implement software requirements.\nWrite clean, reusable, and efficient code for both client-side and server-side applications.\nBuild responsive and scalable user interfaces using modern web technologies.\nDevelop and maintain APIs to ensure smooth integration between front-end and back-end systems.\nConduct unit testing and ensure the quality and performance of applications.\nTroubleshoot and debug issues across both front-end and back-end components.\nOptimize applications for speed, scalability, and security.\nStay up-to-date with the latest industry trends and best practices in full-stack development.\nQualifications:\nEducation:\nBachelor's degree in Computer Science, Software Engineering, or a related field.\nSkills and Experience:\nProven experience as a Full-Stack Developer with expertise in both front-end and back-end technologies.\nStrong proficiency in front-end technologies including HTML, CSS, JavaScript, and modern JavaScript frameworks such as React, Angular, or Vue.js.\nExperience with back-end technologies such as Node.js, Java, Python, or PHP.\nProficiency in working with databases (SQL and NoSQL, e.g., MySQL, PostgreSQL, MongoDB).\nFamiliarity with RESTful API development and integration.\nExperience with version control systems like Git.\nUnderstanding of cloud platforms (AWS, Azure, Google Cloud) and containerization (Docker, Kubernetes).\nStrong knowledge of web development best practices, including responsive design, security, and performance optimization.\nExperience with Agile/Scrum methodologies.\nSoft Skills:\nStrong problem-solving and troubleshooting skills.\nExcellent communication and teamwork abilities.\nAbility to work independently and manage multiple tasks effectively.\nA passion for learning new technologies and improving coding practices.\nHow to Apply:\nInterested candidates can submit their resumes and portfolios.\nJob Types: Full-time, Contract, Temporary\nPay: $120,000.00 - $170,000.00 per year\nSchedule:\nMonday to Friday\nWork Location: Remote",
    "salary": "$120,000 - $170,000 a year - Temporary, Full-time, Contract",
    "job_details": "Job details\nPay\n$120,000 - $170,000 a year\nJob type\nTemporary\nContract\nFull-time\nShift and schedule\nMonday to Friday\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=de1bfcd2e6d3a4e0&bb=joHeW4OfLPX-tP8tPFKrREfjFsOExf06hYlCAxXHzgbubxtE_sxp1I-bVC-XaL-mbmcktSRff8tdskeX1zGOs1JAhulbM4xpZBW8a51Ktx-34yfLEvsEuA%3D%3D&xkcb=SoCH67M30YXCMHQh8Z0PbzkdCdPP&fccid=be3b11aa573faee7&vjs=3",
    "title": "Software Engineer",
    "description": "At CVS Health, we’re building a world of health around every consumer and surrounding ourselves with dedicated colleagues who are passionate about transforming health care.\nAs the nation’s leading health solutions company, we reach millions of Americans through our local presence, digital channels and more than 300,000 purpose-driven colleagues – caring for people where, when and how they choose in a way that is uniquely more connected, more convenient and more compassionate. And we do it all with heart, each and every day.\nHow will this role have an impact?\nA Software Engineer develops systems to manage data flow throughout Signify Health’s infrastructure. This involves all elements of data engineering and processing messages and data at huge volumes.\nWhat will you do?\nCommunicate with business leaders to help translate requirements into functional specification\nDevelop broad understanding of business logic and functionality of current systems\nAnalyze and manipulate data by writing and running SQL queries\nAnalyze logs to identify and prevent potential issues from occurring\nDeliver clean and functional code in accordance with business requirements\nConsume data from any source, such a flat files, streaming systems, or RESTful APIs\nInterface with Electronic Health Records\nEngineer scalable, reliable, and performant systems to manage data\nCollaborate closely with other Engineers, QA, Scrum master, Product Manager in your team as well as across the organization\nBuild quality systems while expanding offerings to dependent teams\nComfortable in multiple roles, from Design and Development to Code Deployment to and monitoring and investigating in production systems.\nRequirements\nBachelors in Computer Science or equivalent\n3 plus years in software engineering\nStrong software engineering fundamentals (data structures, algorithms, async programming patterns, object-oriented design, parallel programming)\nStrong understanding and demonstrated experience with at least one popular programming language (.NET , GoLang or Java) and SQL constructs (PostGres, Snowflake, MS SQL).\nExperience writing and maintaining frontend client applications, Angular preferred\nStrong experience with revision control (Git)\nExperience with cloud-based systems (Azure / AWS / GCP).\nHigh level understanding of big data design (data lake, data mesh, data warehouse) and data normalization patterns\nDemonstrated experience with Queuing technologies (Kafka / SNS / RabbitMQ etc)\nDemonstrated experience with Metrics, Logging, Monitoring and Alerting tools\nStrong communication skills\nStrong experience with use of RESTful APIs and AKKA messaging technology\nHigh level understanding of system deployment tasks and technologies. (CI/CD Pipeline, Kubernetes, Terraform).\nAbout Us:\nAs Signifiers, we are the heart of our culture. We define and build it - from how we treat each other, to responding to our members’ needs and serving our communities. Living our Heart At Work Behaviors™ in every interaction every day helps us to put our purpose into action for our customers and members and create a workplace where we can all thrive. Every Signifier plays an important role in creating the culture we need, want, and deserve. We do this by putting people first, joining forces, creating simplicity, championing safety and quality, rising to the challenge, and inspiring trust. Join our team and bring your heart to work as we innovate and deliver solutions to make healthcare more personal, convenient and affordable.\nSignify Health, A CVS Health company, provides value-based care, reduces costs and improves outcomes for older adults. Our network of more than 12,000 clinicians across 50 states provides health risk assessments to health plan members. This brings clinicians into patients’ homes to identify chronic conditions, help bridge gaps in care, address social and behavioral risk factors on health and improve members' engagement.\nAnticipated Weekly Hours\n40\nTime Type\nFull time\nPay Range\nThe typical pay range for this role is:\n$72,100.00 - $144,200.00\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.\n\nOur people fuel our future. Our teams reflect the customers, patients, members and communities we serve and we are committed to fostering a workplace where every colleague feels valued and that they belong.\nGreat benefits for great people\nWe take pride in our comprehensive and competitive mix of pay and benefits – investing in the physical, emotional and financial wellness of our colleagues and their families to help them be the healthiest they can be. In addition to our competitive wages, our great benefits include:\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.\nFor more information, visit https://jobs.cvshealth.com/us/en/benefits\nWe anticipate the application window for this opening will close on: 06/27/2025\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.",
    "salary": "$72,100 - $144,200 a year - Full-time",
    "job_details": "Job details\nPay\n$72,100 - $144,200 a year\nJob type\nFull-time\nWork setting\nRemote\nEncouraged to apply\nFair chance\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=6644b21fc92a452e&bb=joHeW4OfLPX-tP8tPFKrRNEoQ6nD8ef-SQPcugrz2rVBbzJAPbaFzrk1esZ-dM40fILKVqwgPd2aIcrPIEYgwDIwK0NiD88FMCN4cDFyR_stn10utEDVOg19j5VwzIs0&xkcb=SoAz67M30YXCMHQh8Z0ObzkdCdPP&fccid=c060d0df634ace82&vjs=3",
    "title": "Software Engineer_IT",
    "description": "Software Engineer\n\nSoftware Engineer\n\nWho are we?\n\nVersant Health is one of the nation’s leading administrators of managed vision care, serving millions of our clients’ members nationwide. We are driven by our mission to help members enjoy the wonders of sight through healthy eyes and vision.\n\nAs a Versant Health associate, you can enjoy a comprehensive Total Rewards package, which includes health and dental insurance, tuition reimbursement, 401(k) with company match, pet insurance, no-cost-to-you vision insurance for you and your qualified dependents. We are also invested in your success. There are many opportunities for advancement and development throughout all stages of your career with us.\n\nSee how you can make a difference with the support of strong leadership and a team environment.\n\nSee Everything, Be Anything™.\n\nWhat are we looking for?\n\nThe role of the Software Engineer is to develop and maintain highly scalable and efficient software and applications that meet or exceed end-user specification and IT system objectives to enable Versant Health business objectives. The ideal candidate will have experience in various technologies our web sites/mobile applications and multiple web service layers are implemented with. Candidates with experience with .net MAUI based mobile applications and .net core 8 web service back ends highly preferred. Must demonstrate the ability and initiative to debug complex multi-tiered applications, and show the ability to create use cases in a de-identified development environment. The ability to produce stable bug free code following DRY coding patterns and thoroughly test all code changes in a development environment will be paramount to your success.\n\nWhere you will have an impact\nParticipate in requirements elaboration and solution design sessions with business stakeholders and product managers to drive better end user experiences and resilient applications\nCollaborate with and across IT teams to build, deploy and support in full stack developments tools and technologies\nRoutinely refactor applications to strengthen security posture, leverage latest technology frameworks, and improve user and software performance\nAdhere software deliverables to Versant Health architectural guidelines and IT operational objectives\nCoordinate with Project Manager and Product Managers to develop level of effort estimates and work plans to achieve project and business milestones\nDevelop and maintain software documentation in accordance with software lifecycle best practices for design, coding, deployment, and production support\nAssist in cross training and/or knowledge transition document and transition for software maintenance and monitoring responsibilities\nCollaborate in and adhere to Agile delivery methodology ceremonies\nParticipate in any/all training and educational activities necessary to fulfill at least the minimum requirements as specified within your departmental goals.\nOn-call availability as required\nOther duties as assigned\nWhat’s necessary to do the job?\n\nPreferred bachelors or master’s degree in Computer Science, Information Systems, or related field or equivalent combination or experience and education.\nFive (5) plus years of full stack development experience, or equivalent\nC#, Dapper\nKnowledge and experience with the following Web technologies: Classic ASP, .NET MVC, Knockout\nKnowledge and experience with the following web service technologies: NET Core Microservices\nKnowledge and experience with API security proxies such as Axway Gateway\nKnowledge and experience with the following mobile application technologies: Xamarin, .net MAUI\nProficiency in SQL, database modeling and database optimization skills.\nProficiency in point-to-point integrations and Restful, SOAP web service interfaces\nFamiliarity with Git/Bitbucket, Octopus, and Team City preferred.\nSaFe Agilist certifications is a plus\nKnowledge and experience in the insurance, health, or vision care industry preferred\nHIPAA & Security Requirements\n\nAll Associates must comply with the Health Insurance Portability Accountability Act of 1996 (HIPAA) as it pertains to disclosures of protected health information (PHI) as described in the Notice of Privacy Practices and HIPAA Privacy Policies and Procedures. As a component of job roles and responsibilities, Associates may have access to covered information, cardholder data or other confidential customer information which must be protected at all times. As a result, Associates must explicitly adhere to all data security guidelines established within the Company’s Privacy & Security Training Program.\n\nVersant Health will never request money from candidates who seek employment with us and will never ask for any payment as part of the recruitment process.\n\nVersant Health is a proud Equal Employment Opportunity and Affirmative Action employer dedicated to attracting, retaining, and developing a diverse and inclusive workforce. All qualified applicants will receive consideration for employment at Versant Health without regards to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity or expression, age, disability, national origin, marital or domestic/civil partnership status, genetic information, citizenship status, uniformed service member or veteran status, or any other characteristic protected by law.\n\nThe wage range for applicants for this position is [$110,000.00 to $120,000.00].\n\nAll incentives and benefits are subject to the applicable plan terms.",
    "salary": "$110,000 - $120,000 a year - Full-time",
    "job_details": "Job details\nPay\n$110,000 - $120,000 a year\nJob type\nFull-time\nShift and schedule\nOn call\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=9ebf8b69bcea40be&bb=joHeW4OfLPX-tP8tPFKrRDlknqG2lVA8TlU3Bp_ZHYUhiXYZxQBKPrfE_cQdD8QHQa0dRORl7SSgpjyaCtAbPI0PR_oNgcyoyVyXAO9gtFC0S_zmlcSVfEg9m5YMr3Fk&xkcb=SoCu67M30YXCMHQh8Z0NbzkdCdPP&fccid=799abe4cbe19077a&vjs=3"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=28bea9a5bb996652&bb=joHeW4OfLPX-tP8tPFKrRH8pGA45HfVoj7qRyPj0-TR_PPa00xwRQjfsvsvrBA89S6rd0TJcU-jj9gOWOt1LkOxpPnyX7Jd1iERRJRkKEgFB3SaKP9rSFg%3D%3D&xkcb=SoAa67M30YXCMHQh8Z0MbzkdCdPP&fccid=be3b11aa573faee7&vjs=3",
    "title": "Senior Software Development Engineer",
    "description": "At CVS Health, we’re building a world of health around every consumer and surrounding ourselves with dedicated colleagues who are passionate about transforming health care.\nAs the nation’s leading health solutions company, we reach millions of Americans through our local presence, digital channels and more than 300,000 purpose-driven colleagues – caring for people where, when and how they choose in a way that is uniquely more connected, more convenient and more compassionate. And we do it all with heart, each and every day.\nHow will this role have an impact?\nJoin us at the start of a new era in health care where technology is transforming how and where care is delivered, creating a more connected, effective care experience for all. Our mission at Signify Health is to build trusted relationships to make people healthier. We do this by transforming the home into a health hub through a combination of data, technology & people. We are building a unied technology platform for value-based care that is improving care and reducing spending by treating patients in lower-cost settings and linking providers’ payments to patient outcomes. Signify Health is driving this industry transformation and solving some of the most challenging problems in healthcare – this is where you come in!\nAbout the Role\nAs a Software Engineer at Signify Health, you'll play a crucial role in our collaborative team, focusing on the design, delivery, and operation of distributed systems. We're looking for technically skilled, passionate individuals who are ready to develop and sustain innovative solutions in our dynamic environment.\nResponsibilities\nDesign and implement scalable web services, applications and APIs.\nWrite clean, ecient, and reusable code using Go and other languages.\nParticipate in all phases of the software development lifecycle.\nDeliver customer-focused releases through iterative development.\nEnsure simplicity and maintainability in software design.\nCollaborate across teams to meet organizational needs.\nPromote a culture of inclusive collaboration and continuous learning.\nBasic Qualifications\n3+ years of experience as a Full Stack Engineer or similar role.\nProciency in Go including advanced concepts such as concurrency patterns using Goroutines and channels\nExperience with languages such as TypeScript, Python, C#, or others.\nExperience with front-end technologies like HTML, CSS and JavaScript.\nSolid foundation in software engineering principles: problem-solving, data structures, algorithms, and patterns.\nStrong understanding of database systems and RESTful API design.\nUnderstanding of distributed systems design, implementation, and operation.\nFamiliarity with at least one cloud vendor: Azure, AWS, or GCP.\nEffective communication skills.\nPreferred Qualifications\nBachelor's degree in Computer Science or related eld, or equivalent work experience.\nFamiliar with Go toolchains such as Go modules, building, testing, proling, and linting\nSkilled in using React and TypeScript for web application development.\nExperience with asynchronous, event-based architectures.\nProciency in technologies like gRPC, Docker, Kubernetes, Terraform.\nKnowledge of Application and Performance Monitoring platforms, e.g., New Relic.\nExperience with CI/CD pipelines.\nFamiliarity with Agile development methodologies.\nAbout Us:\nAs Signifiers, we are the heart of our culture. We define and build it - from how we treat each other, to responding to our members’ needs and serving our communities. Living our Heart At Work Behaviors™ in every interaction every day helps us to put our purpose into action for our customers and members and create a workplace where we can all thrive. Every Signifier plays an important role in creating the culture we need, want, and deserve. We do this by putting people first, joining forces, creating simplicity, championing safety and quality, rising to the challenge, and inspiring trust. Join our team and bring your heart to work as we innovate and deliver solutions to make healthcare more personal, convenient and affordable.\nSignify Health, A CVS Health company, provides value-based care, reduces costs and improves outcomes for older adults. Our network of more than 12,000 clinicians across 50 states provides health risk assessments to health plan members. This brings clinicians into patients’ homes to identify chronic conditions, help bridge gaps in care, address social and behavioral risk factors on health and improve members' engagement.\nAnticipated Weekly Hours\n40\nTime Type\nFull time\nPay Range\nThe typical pay range for this role is:\n$92,700.00 - $185,400.00\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.\n\nOur people fuel our future. Our teams reflect the customers, patients, members and communities we serve and we are committed to fostering a workplace where every colleague feels valued and that they belong.\nGreat benefits for great people\nWe take pride in our comprehensive and competitive mix of pay and benefits – investing in the physical, emotional and financial wellness of our colleagues and their families to help them be the healthiest they can be. In addition to our competitive wages, our great benefits include:\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.\nFor more information, visit https://jobs.cvshealth.com/us/en/benefits\nWe anticipate the application window for this opening will close on: 06/27/2025\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.",
    "salary": "$92,700 - $185,400 a year - Full-time",
    "job_details": "Job details\nPay\n$92,700 - $185,400 a year\nJob type\nFull-time\nWork setting\nRemote\nEncouraged to apply\nFair chance\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=58ac796ae1ecc017&bb=joHeW4OfLPX-tP8tPFKrRCMWVshe83v1dNN5wnf4ZDWO4euPnY3WgPlnpHLJv4vHZw5CnG3l4L2TWal1Osjnnu7qq6ItlGvoffF2GlOSCqNbHXajf-6GWibuZs-p34oT&xkcb=SoDz67M30YXCMHQh8Z0DbzkdCdPP&fccid=2c62e6ec3b681b6e&vjs=3",
    "title": "Full-Stack Software Engineer",
    "description": "About The Information\n\nThe Information is the go-to source of in-depth reporting for the most influential leaders in technology and business. Founded in 2013 and headquartered in San Francisco, our original, high-quality journalism has the power to inform the most consequential decisions shaping our future, and we’ve built a community of 700,000 active readers who depend on us to do just that. We have a financially healthy business, plenty of capital, and big ambitions to grow our team and business.\n\nAbout the role\nOur engineering team, within our business division, is looking for a driven and collaborative product engineer to help scale, improve, and maintain the technical systems that power our business. In this role, you’ll work on building new features, enhancing existing ones, and ensuring the stability and reliability of our platform. Along the way, you’ll contribute ideas for improving our systems and identifying opportunities for tech-driven initiatives that move the needle for the business, while also troubleshooting and resolving issues to support a seamless user experience, for both our internal teams and our end users.\nWhat you'll do\nParticipate in the development of new features and improvements, adhering to best practices and ensuring code quality.\nContinuously improve technical systems to align with evolving business needs.\nEnsure the reliability and performance of our internal and external facing applications through proactive support and maintenance.\nPropose and implement tech-driven ideas to move the needle for the business.\nDiagnose and resolve technical issues to enhance system stability and user experience.\nEngage in code reviews to share feedback and exchange ideas with peers.\nContribute to a culture of learning and teaching by sharing knowledge and supporting team development.\nEvolve into a Subject Matter Expert (SME), where you’ll be the go-to engineer for an area of our business.\nQualifications\n2+ years of professional experience as a Full Stack Software Engineer, with exposure to web development.\nFamiliarity with cloud infrastructure, such as Heroku and Cloudflare (which we use), AWS, or similar platforms.\nStrong problem-solving skills and the ability to debug technical challenges.\nEffective communication and teamwork skills, with a collaborative mindset.\nA willingness to learn, share knowledge, and grow with the team.\nExperience working in a server-side language (we primarily use Ruby on Rails, but Python, Node, etc., is also acceptable).\nExperience working in JavaScript and React.\nExperience working in relational databases (e.g., PostgreSQL).\nUnderstanding of database architecture.\nBonus Qualifications\nExperience working with Ruby on Rails, TypeScript preferred.\nExperience with performance optimization or scalability.\nFamiliarity working with a CDP platform like Segment, CustomerIO or BlueConic\nBenefits\nCompany-paid medical, dental, and vision coverage for employees and their dependents\nBasic life insurance\nGenerous paid leave that increases over time\nA parental leave policy for new parents\n401(k) plan with company match\nFlexible Spending Account\nAdditional benefits include commuter benefits, gym and fitness stipend, and phone reimbursement\nSalary Range: $130,000 - $150,000 USD Annually + Bonus + Benefits\nThe salary range posted is based on the company's good faith belief at the time of the posting. Actual compensation may vary above or below this range based on factors such as location, work experience, and skill level.\nWe are an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to diversity and to building an inclusive environment for people of all backgrounds and ages.",
    "salary": "Full-time",
    "job_details": "Job details\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=41d3595b646cc385&bb=joHeW4OfLPX-tP8tPFKrRJK2JTZYhB19p46zvC5E53bwPNqylyDLfUGowPhXBYZu4s_X2HIGTUcK17wr100iTzRk-_GzWCKTw-707At7XFgCyD0rmQkf2-jl9gH6xhzF&xkcb=SoBH67M30YXCMHQh8Z0CbzkdCdPP&fccid=fce5156fed4e114c&vjs=3",
    "title": "Software Engineer",
    "description": "Alkami is a leading cloud-based digital banking solutions provider for financial institutions in the United States that helps clients to transform through retail and business banking, digital account opening and loan origination, payment fraud prevention, and data analytics and engagement solutions. Alkami’s Mobile App Platform has been certified by J.D. Power for providing clients with “An Outstanding Mobile Banking Platform Experience.”\nFounded in 2009, we continue to be recognized for our intentional culture and tremendous growth (Best Place to Work in Fintech; Best & Brightest to Work For Nationally; and Comparably’s Best Company Culture, Best Career Growth, Best Engineering Team, and Best Places to Work in Dallas, among others). Through our bold investments in technology and people, we empower our clients to grow confidently, adapt quickly, and build thriving digital banking communities through tailored experiences for over 19.5M users.\nAs a remote-first company, most of our positions can be remote in the US, except for key roles, which will be indicated in the Job Title.\nFollow us on\nGlassdoor\nand\nLinkedin\n!\n\nAlkami is seeking a highly skilled Software Engineer to join our Software Tooling and DevSecOps team. The successful candidate will have experience designing and delivering reliable, scalable, and highly performant microservice and event-driven architectures leveraging Kubernetes for container orchestration, as well as DevSecOps tooling to handle build and deploy pipelines.\nWe’re seeking an experienced engineer who has developed web and API applications and worked in a distributed, N-tier architecture environment to help us build the next generation of Alkami’s digital banking platform. Our Developers work in an Agile environment and are passionate about creating a seamless user experience for our clients and their customers.\nKey Responsibilities & Duties:\nContribute to new features and functionality for our microservice architecture, Kubernetes infrastructure, and service communication/observability systems.\nBuild and maintain tools for use by our development teams for the DevSecOps pipelines which build and deploy the Alkami platform, specializing in the microservice tier.\nTroubleshoot and resolve complex technical issues, including performance, related to our microservices and Kubernetes systems, including debugging code to identify the root cause of issues.\nCreate performant, scalable, and reliable solutions, including providing technical guidance, best practices and code examples to other integrating teams.\nSupport an “inner source” model for development, enabling contributions from other development teams, while maintaining governance over the core platform.\nDocument technical issues and resolutions in our knowledge base and communicate them to our customers and internal teams.\nTest-driven development while championing an API-first approach software projects, ensuring seamless integration, scalability, and extensibility.\nSet up and maintain environment configurations and monitor system health\nParticipate in on-call rotation and respond promptly to on-call incidents, including troubleshooting and resolving critical disruptions to ensure platform availability\nQualifications:\nBachelor's or Master's degree in Computer Science, Computer Engineering, or a related field or equivalent work experience.\n2-4 years of experience in software development or a related field and experience working within Agile framework.\nStrong programming skills in an object oriented / functional programming language such as Java, C#, Golang, Python, Kotlin et al with proven work experience as a full-stack developer.\nExperience designing performant and scalable solutions with cloud-native technologies such as Kubernetes\nExperience building components and pipelines as part of a DevSecOps framework to support CI/CD for cloud-native applications\nExperience with database frameworks such as NoSQL, SQL Databases, Object-Relational Mapping (ORM) frameworks\nExperience supporting production systems, including identifying issues through monitoring, troubleshooting and resolving issues, and implementing proactive measures through alerting on key performance metrics and defensive coding\nSelf-motivated and able to work independently as well as part of a team, with good analytical and time management skills, a bias towards action, and ability to rapidly learn new technologies and solutions to deliver value with some assistance\nUnderstanding and practical application of REST API best practices. Proficiency in adhering to standards, ensuring security, scalability, and optimal performance\nDeveloping tests including unit tests, UI automation tests, integration tests\nUnderstanding of the entire software development process (design, development and deployment)\nStrong written and verbal communication skills, with demonstrated experience providing technical input\nAbility to participate in on call rotation\nDesired Skills:\nExperience with OpenTelemetry (or similar)\nExperience designing Kubernetes-native microservice architectures, with an emphasis on scalability and performance\nExperience architecting and designing event-driven architectures\nExperience working with and designing RESTful and/or gRPC APIs\nExperience with AWS or equivalent cloud infrastructure\nExperience working with SaaS offerings in the technology and financial industries\nThe salary range for this position is $92,000 to $138,000\nCool Things to Know\nNot Just Any Company: Alkami has an awesome diverse and inclusive environment. We have a FUN culture and offer great benefits, including remote-first environment, unlimited paid time off, 401(k) with employer match, and more.\nWork Authorization: We cannot offer employment sponsorship at this time. Candidates must be eligible to work in the US for full-time employment.\nRecruiters: We are not looking for outside recruiting firms to help us in this search. Thank you for understanding.\nPay Transparency: As of January 1, 2023, new states and locales have enacted pay equity laws that require more pay transparency by employers in the following states: California, Colorado (effective January 1, 2021), Connecticut, Maryland, Nevada, New Jersey, New York, Ohio, Rhode Island and Washington.\nThe Important Stuff\nAlkami Technology is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: Alkami is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Alkami are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Alkami will not tolerate discrimination or harassment based on any of these characteristics. Alkami encourages applicants of all ages.\n#LI-REMOTE\n\nJ.D. Power 2024 Mobile App Platform Certification ProgramSM recognition is based on successful completion of an audit and exceeding a customer experience benchmark through a survey of recent servicing interactions. For more information, visit jdpower.com/awards.",
    "salary": "$92,000 - $138,000 a year - Full-time",
    "job_details": "Job details\nPay\n$92,000 - $138,000 a year\nJob type\nFull-time\nShift and schedule\nOn call\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=2f2a45d073b7f7a3&bb=joHeW4OfLPX-tP8tPFKrRLwbfMgSXgx4GCxp1X3hyF_i1128yERa-AB497OH6sqHUF-LG0IaWttu6m_8iemdmf_AFv2Gc5dvKlcqpu89I8fUVTvF3TytPpPxt-tt-YMs&xkcb=SoDa67M30YXCMHQh8Z0BbzkdCdPP&fccid=c0222312b34b096a&vjs=3",
    "title": "Software Engineer",
    "description": "Blend is a diverse team of problem solvers who believe that the world's financial resources should be more accessible. Our cloud banking platform is used by Wells Fargo, U.S. Bank, and over 330 other financial services firms to acquire more customers, increase productivity, and deliver end-to-end digital experiences. Our software enables our customers to process an average of more than $5 billion in loans per day, making it possible for consumers to reach their financial goals faster and lead better lives. Come do work that matters.\n\nThe Lender team owns the user experience for the Loan Officers working with Loan applications. We enable Loan Officers to do more by automating the manual parts of the mortgage process, such as pulling real time Pricing data and generating configurable PreApproval documents.\nWe are seeking a skilled Full Stack Engineer to join our team and contribute to the continued success of Blend. As a Full Stack Engineer, you will be responsible for designing, implementing, and maintaining our web applications. You will work closely with our product development team to understand and translate customer needs into functional and scalable software solutions. The ideal candidate should have an interest in both frontend and backend development.\nHow you will contribute:\nCollaborate with cross-functional teams to understand and translate business requirements into technical specifications & code\nWork with product managers and UI/UX designers to implement new features and enhancements\nDesign & develop applications to scale while considering maintenance, resiliency, and robustness\nImplement responsive user interfaces and ensure a seamless user experience across all devices with accessibility in mind\nIdentify and troubleshoot software defects and issues, ensuring timely resolution\nParticipate in code reviews to maintain code quality and ensure best practices\nEncourage great habits to enhance team practices by participating in code reviews\nCreate your own story! Some of Blend's best features have come from engineering initiatives. You'll have an opportunity to propose new ideas and build features end-to-end\nWho you are:\nBachelor's degree in Computer Science or equivalent education background\nStrong computer science fundamentals (data structures and algorithms)\nCoding experience with any major language, like TypeScript/JavaScript, Golang, Python, Java, C++, etc.\nYou are an Excellent communicator and can operate independently & collaboratively in a fast-paced environment, driving projects to a successful outcome\nAbility and willingness to help others succeed and be productive\nBonus points:\nExperience working with frontend frameworks: React/Angular/Vue\nExperience working with Typescript and Node.js\nExperience working with PostgreSQL, MongoDB\nFor full time hires, the hiring base pay range for this position is between $91,000 and $124,000. Beyond base pay, Blend benefits and perks are described below.\nFinal base pay offer amounts will vary depending on multiple factors, including but not limited to function, level, geographic location, job related knowledge, skills, and experience. Base pay will be adjusted for part-time roles to reflect scheduled hours.\nBenefits and Perks:\nMeaningful equity\n401(k) plan with employer matching contribution\nComprehensive health benefits\n16 weeks of paid parental leave\nGenerous vacation policy\nWork from home office set up stipend and internet stipend\nWellness benefits covering a variety of wellness activities, gym memberships, fitness classes and more\nBlend is an equal opportunity employer that values diversity, inclusion and belonging. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status disability status, or any other characteristic protected by law. We will consider for employment all qualified applicants with arrest and conviction records in a manner consistent with applicable law, including the San Francisco Fair Chance Ordinance.",
    "salary": "Part-time, Full-time",
    "job_details": "Job details\nJob type\nPart-time\nFull-time\nWork setting\nRemote\nEncouraged to apply\nFair chance\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=43d67d2855803460&bb=joHeW4OfLPX-tP8tPFKrRB-HmMyxk5tCJk8nPhGGu7ipzejCHQQPfFTZEbqbLkC1ING3A1tQYVAS8Bgbb7jP7wSJsLvg66oiGrPAg3cIt52qFkkjH6qTECVST6Bvg6te&xkcb=SoBu67M30YXCMHQh8Z0AbzkdCdPP&fccid=ada05c5c250127f1&vjs=3",
    "title": "Full Stack Engineer",
    "description": "About Andium\n\nDo you want to have global impact?\nAt Andium we help Oil & Gas companies reshape the future, while working toward Net-Zero emission goals. We are building technology that helps the world’s leading energy companies reach their environmental, social, and governance (ESG) goals through transformative innovation. Along that pathway, we have helped achieve 46% operations cost savings and 65% reduction in emissions.\n\nHow do we do it?\nUnique in the marketplace, we are an Industrial Internet of Things, IIoT, company that designs, builds, and implements integrated technologies to perform end-to-end methane gas monitoring and tracking, allowing our customers to maximize field resources to resolve situations real-time. Our technologies combine on-site multi-dimensional video with a machine learning/AI-based platform. Our designs are based on past and current performance and where the market is heading. We are financially strong with a clear path for growth.\n\nIf this sounds interesting, read on to learn what we are seeking in a Full Stack Engineer.\n\nAbout the Role\nAndium is looking for a talented Full Stack Engineer to join our team. In this role, you will design and develop scalable, high-performance applications while working closely with engineering and product teams. You will be responsible for creating intuitive front-end user interfaces as well as efficient and robust backend services.\nThis position is ideal for someone who is passionate about shaping products through building modern web applications, solving complex problems, and delivering high-quality software in a fast-paced environment.\nResponsibilities:\nDesign, implement, and maintain scalable, reliable, and extensible web applications.\nWork closely with engineers and product teams to develop new features and user experiences.\nRapidly prototype, integrate, and validate new product ideas.\nDevelop responsive and user-friendly front-end interfaces.\nBuild and maintain backend APIs and services, ensuring seamless integration with databases.\nOptimize applications for performance, scalability, and maintainability.\nMonitor system performance and proactively resolve issues.\nMaintain documentation for system architecture, features, and best practices.\nSupport software quality assurance and performance optimization efforts.\nProvide end-user support when necessary.\nQualifications:\n4+ years of experience as a Full Stack Engineer or in a similar role.\nStrong proficiency in JavaScript, HTML, and CSS with experience in React or similar front-end frameworks.\nProficiency in Python and experience with FastAPI or similar backend frameworks.\nExperience with PostgreSQL or similar relational databases.\nSolid understanding of front-end, back-end, and data security best practices.\nExperience with charting libraries and data visualization.\nExperience with implementing video streaming in applications a plus\nExperience with event-driven services and applications is a plus.\nFamiliarity with pub/sub messaging technologies like RabbitMQ or MQTT is a plus.\nExperience working with time-series data is a plus.\nWhy Join Us?\nWork with cutting-edge technology in a fast-growing sector and be part of a team shaping the future of emissions detection and monitoring solutions.\nEngage in meaningful work with real-world impact, from large multinationals to entrepreneurial operators.\nCareer growth opportunities in a collaborative and forward-thinking environment.\nCompetitive compensation package, including health, vision, and dental coverage.\nGenerous vacation and sick leave, including paid parental leave.\n\nCompensation Range\n$100,000-$140,000 plus competitive equity package\nConsistent with Andium’s values and applicable law, we provide this information to promote pay transparency and equal opportunity. Pay within this range varies based on job-related knowledge, skills, and experience. Actual offers will be based on the individual candidate.",
    "salary": "Full-time",
    "job_details": "Job details\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=cd7e52a0e5480424&bb=joHeW4OfLPX-tP8tPFKrRDpxzqb0Ah2NJ2TwPte9pDMzzcNDTu8mc7bUYsb4gqCeXJbY0Dzbcedel2YARAjR3TWmbZ-g5w4UTNXodsi-qNQFMmvcjO6gcA%3D%3D&xkcb=SoDg67M30YXCMHQh8Z0HbzkdCdPP&fccid=be3b11aa573faee7&vjs=3",
    "title": "Software Development Engineer",
    "description": "At CVS Health, we’re building a world of health around every consumer and surrounding ourselves with dedicated colleagues who are passionate about transforming health care.\nAs the nation’s leading health solutions company, we reach millions of Americans through our local presence, digital channels and more than 300,000 purpose-driven colleagues – caring for people where, when and how they choose in a way that is uniquely more connected, more convenient and more compassionate. And we do it all with heart, each and every day.\nPosition Summary\nAbility to analyze and assist with the design, development and support of Specialty AR Systems\nDuties include:\nAnalyze user needs and develop software solutions, components, and frameworks to meet business requirements.\nInvolve in requirements analysis to determine feasibility of design and plan the technical aspects of implementation; configure and test software applications and/or systems to improve functionality and features with a focus on performance, reliability, and maintainability.\nWrite, debug, and review high quality code, and track and resolve production issues.\nDesign and develop applications, systems, and databases used to Accounts Receivable related transactions.\nCollaborate with cross-functional teams on applications development, technical requirements, code review, project deliverables, quality assurance, and software development best practices.\n\nRequired Qualifications\n2 -5 years of experience in Oracle/PL SQL or Oracle Forms.\n1 year of experience in Java, Angular, JavaScript, React, jQuery, Ajax, Hibernate, Bootstrap, Rally, JIRA, or ALM.\n\nPreferred Qualifications\nAgile methodologies or SAFe Software Development Principles.\nSecure Coding techniques\nHealth care industry knowledge and background preferred.\nDevelopment knowledge of Cloud/GCP Technologies- Apache Spark Java, Data Composer, Dataproc, Cloud Function, BigQuery, SQL.\n\nEducation\nBachelor’s degree or equivalent experience.\nAnticipated Weekly Hours\n40\nTime Type\nFull time\nPay Range\nThe typical pay range for this role is:\n$72,100.00 - $144,200.00\nThis pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.\n\nOur people fuel our future. Our teams reflect the customers, patients, members and communities we serve and we are committed to fostering a workplace where every colleague feels valued and that they belong.\nGreat benefits for great people\nWe take pride in our comprehensive and competitive mix of pay and benefits – investing in the physical, emotional and financial wellness of our colleagues and their families to help them be the healthiest they can be. In addition to our competitive wages, our great benefits include:\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.\nFor more information, visit https://jobs.cvshealth.com/us/en/benefits\nWe anticipate the application window for this opening will close on: 03/25/2025\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws.",
    "salary": "$72,100 - $144,200 a year - Full-time",
    "job_details": "Job details\nPay\n$72,100 - $144,200 a year\nJob type\nFull-time\nWork setting\nRemote\nEncouraged to apply\nFair chance\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=99a09ee1122c9797&bb=joHeW4OfLPX-tP8tPFKrRLzJygZfEWw7oWSkXYVwEZBZ6En8p0ESrgcRr4tgOY08LGXihi03dWmdku9dYOLAB_zqRduxy__IbfVBk-2O1fH6aFCYp3NQV9d32FRIU6Qh&xkcb=SoBU67M30YXCMHQh8Z0GbzkdCdPP&fccid=611c0eb8907c49a2&vjs=3",
    "title": "Senior Software Engineer, Frontend",
    "description": "In the time it takes you to read this job description, RapidSOS will have handled ~1,380 emergencies.\nAt RapidSOS, we are committed to using technology to build a safer, stronger future and working together to save lives. We're in an exciting phase of growth, welcoming new members from across the globe to our mission-driven, ambitious, and inclusive team. Our work is founded on our values of trust and safety, pioneering, urgency, and purpose over pride, all of which support a company culture where people can innovate, collaborate, grow, and, above all, make an impact. If that sounds like an exciting opportunity, we want to hear from you!\nRapidSOS is an intelligent safety company that harnesses artificial and human intelligence to fuse life-saving data from 540M+ connected devices, apps, and sensors from 200+ global technology companies to over 21,000 public safety agencies in six countries. Whether there's an unsafe moment or an emergency, RapidSOS Ready devices, vehicles, homes, or buildings deliver essential data to the right place when it matters most. Learn more at www.RapidSOS.com.\nWhat this role is about:\nAre you passionate about crafting dynamic, cutting-edge frontend experiences that drive impactful solutions? At RapidSOS, we're transforming emergency response with innovative technology that delivers critical, life-saving data to dispatchers covering 99% of the U.S. population.\nWe're seeking a Senior Software Engineer, Frontend to build intuitive, visually engaging, and robust user interfaces that bridge the gap between complex technical solutions and real-world challenges. In this role, you'll work hands-on with cross-functional teams to develop our platform, integrating advanced and AI-driven features that enable rapid, data-driven decision-making in emergency situations. You'll also play a pivotal role in driving architectural decisions, ensuring our interfaces are scalable, high-performing, and accessible.\nIf you thrive in a fast-paced, mission-driven environment and are excited about leveraging cutting-edge technologies to make a tangible impact where every second matters, this is your opportunity to help shape the future of public safety!\nWhat you'll do:\nDrive the architecture, design, and implementation of new features for RapidSOS UNITE—a React-based application that handles an average of 400,000 emergency calls daily\nLead strategic architectural decisions, help drive alignment, and optimize applications for performance, scalability, and accessibility\nEngineer dynamic, responsive user interfaces for public safety systems that integrate aesthetics with intuitive, user-centric interactions\nCollaborate closely with Product Designers to deliver exceptional user experiences while ensuring technical feasibility of UI/UX designs\nIdentify opportunities to assess and enhance current applications, including refactoring code and upgrading technologies used\nCollaborate in an agile environment with stakeholders across Engineering, Public Safety, Design, and Product to develop frontend solutions for RapidSOS products\nActively participate in code reviews and standups, sharing knowledge, championing best practices, and contributing to the continuous improvement of team processes\nOwn meaningful parts of our platform, have an impact, grow with the company\nWhat we're looking for in our ideal candidate:\n5+ years of professional engineering experience with 3+ years of developing rich, interactive, scalable frontend applications with React/Redux\nExperience with modern CSS frameworks and libraries such as Styled Components\nExperience integrating with RESTful APIs\nStrong communication and interpersonal skills; is a team player with a positive attitude\nHighly self-motivated; ability to adapt and learn quickly in a fast-paced environment with a strong sense of ownership\nCares deeply about the user experience and is able to quickly identify the optimal visual strategies to meet both product and design goals\nStrong proficiency in coding best practices – ability to write clean, maintainable, and testable code\nDemonstrated expertise in problem solving – troubleshooting issues and debugging a large codebase\nThis role requires being based in Boston or NYC, or within commutable distance, along with the ability and willingness to collaborate in person quarterly or as needed\nNice-to-have experience (but not required!):\nExperience integrating with WebSocket APIs for real-time data streaming\nExperience working with a Map UI provider such as Google Maps or ESRI\nFamiliarity with TypeScript\nExperience with a JavaScript testing tool (We use Jest, Playwrite, and React testing library at RapidSOS but any testing library experience would be helpful!)\nUnderstanding of JavaScript security best practices\nFamiliarity with design handoff tools like Figma\nWhat we offer:\nThe chance to work with a passionate team on solving one of the largest challenges globally\nCompetitive salary and benefits and equity participation\nA dynamic, flexible and fun start-up work environment with a highly talented team\nIf you're curious to learn more about RapidSOS, you can check out https://rapidsos.com/blog/\nStarting pay for a successful applicant will depend on a variety of job-related factors, which may include experience, relevant skills, training, education, location, business needs, or market demands. The salary range for this role is $145,000 - $165,000. This role will also be eligible to receive equity options. #LI-Remote #LI-MC1\nRapidSOS is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status.\nInterested in the role but you don't meet 100% of the requirements? We'd love to hear from you! We encourage you to apply; we'd be excited to see if your unique skill set and experience could be a match.",
    "salary": "$145,000 - $165,000 a year",
    "job_details": "Job details\nPay\n$145,000 - $165,000 a year\nWork setting\nRemote\n&nbsp;"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=840f6dc66fea8106&bb=joHeW4OfLPX-tP8tPFKrRA_esmr0b1OsdJXgCRsVs_r4Yt0dbjFTs_Be2H0D7ITrWw27GrFwF9RkYshBnL3Y4RPNEohIamvUe-tKCgLw0EiJQUed2B6bFJUq7O52hwdb&xkcb=SoDJ67M30YXCMHQh8Z0FbzkdCdPP&fccid=fe5a59e339d4c8bf&vjs=3",
    "title": "Software Engineer II",
    "description": "FloQast is looking for a motivated Software Engineer that will play a key contributor role in shipping high impact features. This individual will help identify product and engineering opportunities that will delight our customers and build solutions that exceed their quality expectations. The right candidate should have a track record of building, testing, deploying, and soliciting feedback from stakeholders in a pre product-market fit or fast paced startup environment. You will work closely with your team, sales, and our customers to define, prioritize, and build new features.\n\nFloQast is headquartered in Los Angeles, CA and we are seeking US-based REMOTE Engineers.\n\nVisa sponsorship is NOT available at this time\n\nWe will be accepting applicants for this job through Monday Mar 7th, 2025.\nWhat You'll Do\nBuild high quality, user focused experiences from the ground up with React, NodeJS, and MongoDB\nLeverage Amazon Web Services (AWS) such as S3, Lambda, and Step Functions to get features to market quickly and efficiently\nCollaborate on our technical vision. Participate or lead discussions and implementation on multiple complex projects\nContinuously act on our customers’ product feedback, data, and growth needs to epitomize an agile environment by always working on the most important things\nContinuously improve our engineering process, tools, and systems to increase the team's ability to do more with less\nFully own or pair on vertically sliced features through the full SDLC including code review, deployments, and production support of our applications and external API\nWhat You'll Bring\n1-3 years of professional full stack experience at 1 or more referenceable companies doing web app development, RESTful API design, or data modeling\nProficiency in JavaScript and React, NodeJS, or MongoDB. Being able to think and develop in their patterns and practices. The more the better.\nTrack record of shipping high-quality products and features to customers, and developing projects at scale\nAbility to quickly turn business and product ideas into engineering solutions\nMotivated by taking a product to market, solving customer problems, and mastering your craft through the growth of the business\nNice to haves\nHave taken a product from 0 to 1\nB2B SaaS experience\nPractice TDD, BDD, or use of code coverage\n#BI-Remote\n\n#LI-Remote\n\n#LI-JR1\n\nThis job posting is for our Software Engineer II level, the base pay range for this position is $110,000 - $145,000. Compensation is not limited to base salary. FloQast values our Total Rewards, and offers a competitive and elaborate Benefits Package including, but not limited to, Medical, Dental, Vision, Family Forming benefits, Life & Disability Insurance, Unlimited Vacation, and participation in our Employee Stock Program. FloQast reserves the right to amend, change, alter, and revise pay ranges and benefits offerings at any time. All applicants acknowledge that by applying to this position you understand that this specific pay range is contingent upon meeting the qualifications and requirements of the role, and for the successful completion of the interview selection and process. It is at the Company's discretion to determine what pay is provided to a candidate within the range associated with the role.\n\nAbout FloQast:\nFloQast is the leading Accounting Transformation Platform in accounting workflow automation created by actual former accountants for accountants. By streamlining and modernizing daily accounting tasks, FloQast helps teams collaborate more effectively and complete their work with greater efficiency and precision. This cloud-based, AI-powered software is trusted by over 3,000 accounting teams, including those at Snowflake, Twilio, Instacart, and The Golden State Warriors—and continues to grow. Our mission is to continuously elevate the accounting profession, enhancing both its practice and perception.\n\nOur values act as a guiding compass, shaping every decision we make, and are non-negotiable, particularly in our hiring process. Alongside our employees, partners, and customers, we embody these values every day:\nUnwaveringly Authentic\nAmbitious with Integrity\nEmpowered to Grow\nCommitted to Collaboration\nCustomer Obsessed in All Ways\n\nHere’s Why You Should Apply\nWhat is engineering working on? Our FQ Engineering Blog showcases a number of our recent efforts straight from the engineers working on them. Check it out!\n\nFloQast is regularly rated as a Best Place to Work!\nInc. Magazine’s Best Workplaces in 2024, 2023, 2022, and 2021\nBest Places to Work by LA Business Journal since 2017 (that’s 8 years!)\nBuilt In’s Best Place to Work in Los Angeles 6 years in a row!\n\nBecause we are Customer Obsessed in All Ways, check out what our customers have to say about FloQast on G2 Crowd.\n\nIf this aligns closely with what you are looking for, hit “Apply” and come join our growing team!\n\nFloQast, Inc is committed to operating fair and unbiased recruitment procedures allowing all applicants an equal opportunity for employment, free from discrimination on the basis of religion, race, sex, age, sexual orientation, disability, color, ethnic or national origin, or any other classification as may be protected by applicable law. We aim to recruit the right people for the jobs we have to offer, and to assess applications on the basis of relevant skills, education, and experience. We welcome people of different backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer and strive to provide a professional and welcoming workplace for all employees.",
    "salary": "$110,000 - $145,000 a year - Full-time",
    "job_details": "Job details\nPay\n$110,000 - $145,000 a year\nJob type\nFull-time\nWork setting\nRemote\n&nbsp;"
  }
]