[
  {
    "url": "https://www.indeed.com/rc/clk?jk=f8e02181d39ad2b9&bb=nSgtbvZU0hhkZ5HNLZuBO1uSjrOdldaE0eG-myDcxUIHIr4kxeylml0ZDVjCHnZ6-6up2M8vkmvDA61jfBYVCeatV4mhZO984EySXPTKl3QhNigx9DbbVA%3D%3D&xkcb=SoAp67M30a8U0SS0wB0LbzkdCdPP&fccid=d6ef41e202aa2c0b&vjs=3"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=650fb67c44c043da&bb=nSgtbvZU0hhkZ5HNLZuBO14GaiRo6NQqP9cIM3rRxOCaCl1d06E-pL0ltsjwFZQ32cYrDx91j6BKP5Dq3TyXSykcSPLRztFI7AxNWig1Mb66V524ZOW3mQ%3D%3D&xkcb=SoCd67M30a8U0SS0wB0KbzkdCdPP&fccid=d6ef41e202aa2c0b&vjs=3"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=43a7b687bebdce64&bb=nSgtbvZU0hhkZ5HNLZuBO40pn5yuqL2h5j_Zt0rxz1WefeK0KVQcFdh9IBtlDL9_vpCE5dMVqXit1Ujo4RKtToc0TN8jQjZ0SnaufPwqOy_rUUhu8R88jg%3D%3D&xkcb=SoAA67M30a8U0SS0wB0JbzkdCdPP&fccid=e290923a98afee94&vjs=3",
    "title": "Fullstack Software Engineer",
    "description": "Description\nFullstack Software Engineer\nEnergy, Environment and Infrastructure\n\nLocation: Nationwide Remote. (Portland, Oregon OR Reston, Virginia Preferred)\n\nAre you ready to make a difference?\nWe are seeking a talented Frontend Engineer - Data Visualization to join our Energy, Environmental, and Infrastructure Product and Engineering (EEI P&E) Team. This role supports government and commercial clients in the climate, energy, and clean transportation industries, working across all EEI divisions: Climate, Energy, & Transportation (CET), Environment and Planning (E&P), Utility Program Services (UPS), and Disaster Management (DM). Our goal on the EEI P&E Team is to help clients achieve smart, resilient, and low-carbon growth through our expertise in energy, climate adaptation, greenhouse gas mitigation, sustainability, energy efficiency, and transportation.\nThe ideal candidate has a strong understanding of software engineering principles and a proven track record of being involved in all stages of both large and small projects. Experience working with cross-functional teams and agile software development methodologies is a must, as we value collaboration and flexibility in our approach to project and product management.\n\nThe team supports multiple work streams including software product development, software operations and maintenance, and exploring innovation opportunities to advance our existing suite of offerings. The ideal candidate will be a strong engineer with a broad skillset, growth mindset, and a practical ‘get it done’ work style.\n\nWe operate primarily in greenfield development, synthesizing technologies to create output that meets the needs of our ICF’s domain experts and clients, and as such the suite of software we use is wide. The team also frequently works with geospatial data, so experience in visualizing and manipulating spatial data and spatial data best practices is preferred.\nWhat you will be doing:\nDevelop and maintain software applications in accordance with project requirements in a dynamic, multidisciplinary environment.\nCollaborate with cross-functional teams to design, develop, and implement software solutions.\nWork with internal ICF data scientists, designers, biologists, conservation planners, archaeologists, engineers, transportation experts, and others to build and deliver unique software to meet a wide variety of use cases.\nParticipate in code reviews and peer programming to ensure code quality and adherence to best practices among your peers of software engineers, data modelers, and geospatial information specialists.\nTroubleshoot and resolve software defects and issues.\nContribute to the continuous improvement of software development processes and methodologies within the EEI P&E team.\nWhat we need you to have (minimum qualifications):\nBachelor's Degree in (Information Technology, Computer Science, Software Development or closely related field) and\n5+ years' of experience in Full Stack Development\n5+ years' gathering requirements, and refinement, and planning implementation\n5+ years' in Software development lifecycles: data modeling, cloud and application architecture, user experience and product design, application development, and monitoring.\nExperience with software development methodologies like Agile or Scrum.\nAbility to work independently and proactively, with minimal oversight.\nWhat we would like you to have:\nExperience with the following: AWS, Azure, GCP, Docker, Python, R, C# / .NET, Angular\nFamiliarity with web mapping and charting (or other WebGL) libraries\nRich spatial analysis and mathematical modeling experience\nExperience working with geospatial data\nProficiency in tech solution diagraming and documentation tools such as Draw.io, MS Visio, Mural, Figma, and Confluence\nExperience developing applications consuming and managing high volumes of data\nExperience with UX design principles, (atomic design and component driven design) and a demonstrable eye for clean UI Design\nAbility to convert client needs into concrete steps towards a solution of your design\nAbility to work and communicate effectively with internal and external clients to determine project needs\nDesire to actively share knowledge with team members duing group dev discussions\nAbility to manage multiple competing priorities\nStrong analytical and problem-solving skills with the ability to translate research findings into tech solutions.\n\nPreferred experience in the following:\nFull stack development\nAzure Cloud Services , AWS, or Google Cloud Platform\nSQL databases\nREST/Graph API development and integration\nJavaScript, TypeScript, and Node.js\nReact and NextJS\nGit / Github / DevOps / or similar\nJira or similar\nWorking at ICF\nICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.\nWe can only solve the world's toughest challenges by building a workplace that allows everyone to thrive. We are an equal opportunity employer. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO policy.\n\nReasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation, please email Candidateaccommodation@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nRead more about workplace discrimination rights or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.\n\nCandidate AI Usage Policy\nAt ICF, we are committed to ensuring a fair interview process for all candidates based on their own skills and knowledge. As part of this commitment, the use of artificial intelligence (AI) tools to generate or assist with responses during interviews (whether in-person or virtual) is not permitted. This policy is in place to maintain the integrity and authenticity of the interview process.\nHowever, we understand that some candidates may require accommodation that involves the use of AI. If such an accommodation is needed, candidates are instructed to contact us in advance at candidateaccommodation@icf.com. We are dedicated to providing the necessary support to ensure that all candidates have an equal opportunity to succeed.\n\nPay Range - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.\nThe pay range for this position based on full-time employment is:\n$98,124.00 - $166,810.00\nNationwide Remote Office (US99)",
    "pay_range": [
      "98,124",
      "166,810"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote",
    "company_location": "Portland, OR 97086",
    "company_name": "ICF"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=21c32d3e208616a4&bb=nSgtbvZU0hhkZ5HNLZuBO6J1f-64wmsCselixQbvZtqQdvEfseBepL4cRRF1TiLyuHNmJpIIw57DOEmK9_a3efvqVKcTisbg_pIgr78Moj2DN2rYUimJPu-E1F6LwnyB&xkcb=SoC067M30a8U0SS0wB0IbzkdCdPP&fccid=f1f381861c1f0b69&vjs=3"
  },
  {
    "url": "https://www.indeed.com/rc/clk?jk=030caadba1018222&bb=nSgtbvZU0hhkZ5HNLZuBO1SOw_cjKquKKgJ00IyOY_U8x1JmdNPbOG7ofTbU8dZ9edZ2KZ-Bd3ry68jmbndRTKdzVpuZ3IgPqOlXgtATY5VbhozoZaCKAQ%3D%3D&xkcb=SoA667M30a8U0SS0wB0PbzkdCdPP&fccid=e290923a98afee94&vjs=3",
    "title": "Frontend Software Developer, Data Visualization",
    "description": "Description\nFrontend Software Engineer, Data Visualization\nEnergy, Environment and Infrastructure\n\nLocation: West Coast Preferred (Remote)\n\nAre you ready to make a difference?\nWe are seeking a talented Frontend Engineer - Data Visualization to join our Energy, Environmental, and Infrastructure Product and Engineering (EEI P&E) Team. This role supports government and commercial clients in the climate, energy, and clean transportation industries, working across all EEI divisions: Climate, Energy, & Transportation (CET), Environment and Planning (E&P), Utility Program Services (UPS), and Disaster Management (DM). Our goal on the EEI P&E Team is to help clients achieve smart, resilient, and low-carbon growth through our expertise in energy, climate adaptation, greenhouse gas mitigation, sustainability, energy efficiency, and transportation.\n\nThe Frontend Engineer will lead the design and implementation of high-performance, interactive data visualizations for enterprise-scale applications. This role will own the entire visualization pipeline—from selecting chart types that clarify complex datasets to optimizing React-based dashboards for seamless user interactions. Collaborate with UX and product to bridge aesthetic and functional requirements, ensuring visuals align with brand guidelines while maintaining technical rigor.\n\nThe team supports multiple work streams including software product development, software operations and maintenance, and exploring innovation opportunities to advance our existing suite of offerings. The ideal candidate will be a strong engineer with a design eye, growth mindset, and a practical ‘get it done’ work style.\n\nWe operate primarily in greenfield development, synthesizing technologies to create output that meets the needs of our ICF’s domain experts and clients, and as such the suite of software we use is wide. The team also frequently works with geospatial data, so experience in visualizing and manipulating spatial data and spatial data best practices is preferred.\nWhat you will be doing:\nDesign and develop interactive, user-friendly data visualizations within scalable, responsive browser-hosted applications.\nCollaborate with cross-functional teams to understand data requirements and visualization needs.\nAudit raw datasets to determine optimal visualization strategies.\nUse best practices for data visualization to ensure accuracy and aesthetic appeal.\nEstablish data visualization standards for the team based on best practices and industry trends.\nOptimize visualizations for performance, considering factors like data size and complexity.\nStay updated with the latest trends and tools in data visualization and implement best practices.\nParticipate in code reviews and pair programming to ensure code quality and adherence to best practices.\nWhat we need you to have (minimum qualifications):\nBachelor's Degree in (Information Technology, Computer Science, Software Development or closely related field)\n5+ years of experience with frontend data visualization and charting libraries (e.g., D3.js, Recharts)\n3+ years of experience in JavaScript and frontend frameworks (e.g., React, Angular, Vue.js).\n3+ years of experience evaluating datasets and determining the most effective visualization methods (e.g., charts, tables) to convey information clearly.\n3+ years of hands-on experience in implementing interactive visualizations with a focus on performance optimization, including precomputation strategies and server-side processing.\nExperience with software development methodologies like Agile or Scrum.\nWhat we would like you to have:\nStrong analytical and problem-solving skills with the ability to translate research findings into tech solutions.\nFamiliarity with accessibility standards (e.g., WCAG 2.2, ARIA labels).\nExperience with testing frameworks (e.g., Cypress, Jest) for visualization UIs.\nExperience visualizing multiple types of large amounts of geospatial data in a performant web environment.\nAbility to work and communicate effectively with internal and external clients to determine project needs.\nAbility to manage multiple competing priorities.\n\nExperience in the following preferred:\nD3.js, Recharts, amCharts\nReact, NextJS, and Node.js\nJavaScript, TypeScript\nSQL databases\nGit / Github\nJira or similar\nWorking at ICF\nICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.\nWe can only solve the world's toughest challenges by building a workplace that allows everyone to thrive. We are an equal opportunity employer. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO policy.\n\nReasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation, please email Candidateaccommodation@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nRead more about workplace discrimination rights or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.\n\nCandidate AI Usage Policy\nAt ICF, we are committed to ensuring a fair interview process for all candidates based on their own skills and knowledge. As part of this commitment, the use of artificial intelligence (AI) tools to generate or assist with responses during interviews (whether in-person or virtual) is not permitted. This policy is in place to maintain the integrity and authenticity of the interview process.\nHowever, we understand that some candidates may require accommodation that involves the use of AI. If such an accommodation is needed, candidates are instructed to contact us in advance at candidateaccommodation@icf.com. We are dedicated to providing the necessary support to ensure that all candidates have an equal opportunity to succeed.\n\nPay Range - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.\nThe pay range for this position based on full-time employment is:\n$88,779.00 - $150,924.00\nOregon Remote Office (OR99)",
    "pay_range": [
      "88,779",
      "150,924"
    ],
    "job_types": [
      "Full-time"
    ],
    "shift_and_schedule": null,
    "work_setting": "Remote",
    "company_location": "Portland, OR 97086",
    "company_name": "ICF"
  }
]